{"content": "Compare Best Air Miles Credit Cards in Hong Kong\nRead More\nFind Me A Card\nBest Credit Cards\nWelcome Offers\nCash Back\nAir Miles\nOnline Shopping\nOverseas Spending\nOctopus Card AAVS\nAnnual Fee Waiver\nBill Payment\nDining\nDebit Card\nUnionPay\nDigital Wallets\nBusiness Card\nStudent\nSupermarket\nPetrol\nEntertainment\nFilters\nPromotions\nApple Store Gift Card\nCard Association\nMastercard\nVisa\nUnionpay\nAmerican Express\nCredit Card Features\nAirport Lounge Access\n$0 Foreign Currency Transaction Fees\nNo Minimum Salary Requirement\nProviders\nAll Providers\nAEON Credit Service\nAirwallex\nAmerican Express\nBank of China\nBank of Communications\nBEA\nChina Construction Bank(Asia)\nCitibank\nChina CITIC Bank International\nDah Sing Bank\nDBS\nFubon Bank\nHang Seng Bank\nHSBC\nICBC\nlivi\nMox\nPrimeCredit\nsim\nStandard Chartered\nWeLab Bank\nClear All\nApply\nWe found 37 Credit Cards for you!\nmoneysmart exclusiveRedeem various mileage points without any fee\nDBS Black World Mastercard\nMin. Annual Salary\nHK$240,000\nMiles Conversion (overseas spend)\nHK$4/mile\nUpon meeting local and overseas spending goal*\nHK$3/mile\n【Quick! Apply Today for Exclusive HomePod mini!】From now until 31 January, customers who successfully apply for DBS Blackworld Mastercard via MoneySmart, can enjoy a HomePod mini (retail price: HK$749) or HK$500 Apple Store Gift Card/ Klook Voucher/ PARKnSHOP Supermarket Voucher! You can also earn the bank welcome offer of up to 42,000 miles at the same time!\n\n\n【Apple fans - Attention!】Shop at Apple Store with Flexi Shopping on or before 15 Jan: Save on handling fees in 6 to 60-month installments and get a chance to win a 100% cash rebate on Apple Store spending!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusive\nStandard Chartered Cathay Mastercard\nMiles Conversion(Eligible spending on Cathay and HK Express)\nHK$2 = 1 mile\nMiles Conversion (Eligible spending on dining, online and overseas category)\nHK$4 = 1 mile\nBank Welcome Offer\n63,000 miles\n【SmartPoints - This This Choice - Your Rewards Your Choice】From now until 31 Jan 2024, Apply for Standard Chartered Cathy Mastercard now via MoneySmart to get Bowers & Wilkins PI5 S2 Headphone (value:$2,380) or 8,000 SmartPoints and free to redeem HK$800 vouchers (over 20+ brand vouchers including Apple / Wellcome/ HKTVmall etc)! SmartPoints can be converted into cash and cashed out directly!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusiveEnhanced Welcome Offer\nThe Platinum Card\nMiles Conversion (Overseas Spending)\nHK$6 = 1 Mile\nDiscount at designated restaurants\n40%\nMiles Conversion (Local Spending)\nHK$9 = 1 Mile\n【The Ultimate Choice for High-Spending Mileage: New Year New Offer - Enjoy up to 55,555 Miles!】\nFrom now till January 31, 2024, customers who successfully apply for the Platinum Card via MoneySmart and complete the first transaction within the first 3 months, can earn 100,000 Membership Rewards points + [Limited-time exclusive🔥] additional HK$1,000 statement credit; With aggregate spending of HK$50,000 can enjoy extra 900,000 Membership Rewards points! Up to 1,000,000 Membership Rewards points in total!\n\n\nEquivalent to HK$3,333 statement credit or HK$6,666 travel credit or 55,555 air miles, which is sufficient to redeem round trip tickets to Japan for two or round trip tickets to Europe!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusiveNo expiry date for Membership Rewards points\nAmerican Express Explorer® Credit Card\nMin. Annual Salary\nHK$300,000\nMiles Conversion (Eligible Local Transaction)*\nHK$4.5 = 1 Mile\nComplimentary Plaza Premium Lounge Access\n8 times per Calendar Year\n【⚡️Limited-Time offer of HK$500 Statement Credit】From now on until 31 January, customers who successfully apply for the American Express Explorer Credit Card via MoneySmart can earn 🔥additional HK$500 statement credit when completing the first transaction within the first 3 months, and up to 126,000 American Express Membership Rewards points upon the qualified spending of HK$7,000 within the first 3 months! Spend 7,000 and Earn 7,000 Miles! Plus, you can enjoy 8 complimentary lounge passes for a whole year!\n\n\nUnlock Your Mileage Bonanza! Earn HK$2=1 mile on eligible foreign currency transactions, up to 720,000 Points, enough to redeem for 40,000 miles. Plus, earn HK$4.5=1 mile on eligible local transactions, up to 432,000 Points, enough to redeem for 24,000 miles. That's a potential of up to 64,000 bonus miles - plan your European getaway with your free round-trip ticket!\n\n\n【🌟Attention Eletronic Shoppers!】Looking to take your electronic or Apple product purchases to the next level? The Explorer Card has got you covered! You’ll enjoy an extended 1-year warranty on any purchase; plus earn 5 Membership Rewards points for every eligible HK$1 spent at the Apple Online Store. Seize the chance and APPLY NOW!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusiveUp to 50% savings at designated restaurants\nAmerican Express® Platinum Credit Card\nMin. Annual Salary\nHK$300,000\nMiles Conversion (overseas spend)\n$6 = 1 Mile\nMiles Conversion (local spend)\n$6 = 1 Mile\n【🛫Upgraded! Welcome offers valued up to HK$4,920 upon card approval】\nApply via MoneySmart by January 31, 2024, and seize the rewards! Enjoy 4 complimentary movie tickets and a limited-time offer of 600,000 MR points. Spend HK$3,000 within the first 3 months to receive 🆕 2 complimentary Plaza Premium First Lounge passes (valued HK$1,920). Plus, a spend of HK$5,000 grants you HK$500 city'super cash vouchers. Don't miss out—apply now!\n\n\n600,000 MR points is equivalent to HK$2,000 if you apply Pay with Points Max which is enough to redeem a free round trip flight to Tokyo!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusive\nStandard Chartered Cathay Mastercard - Priority Banking\nMiles Conversion(Eligible spending on Cathay and HK Express)\nHK$2=1 mile\nMiles Conversion (Eligible spending on dining, online and overseas category)\nHK$4 = 1 mile\nBank Welcome Offer\n83,000 miles\n【SmartPoints - This This Choice - Your Rewards Your Choice】From now until 31 Jan 2024, Apply for Standard Chartered Cathy Mastercard now via MoneySmart to get Bowers & Wilkins PI5 S2 Headphone (value:$2,380) or 8,000 SmartPoints and free to redeem HK$800 vouchers (over 20+ brand vouchers including Apple / Wellcome/ HKTVmall etc)! SmartPoints can be converted into cash and cashed out directly!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusive\nStandard Chartered Cathay Mastercard - Priority Private\nMiles Conversion(Eligible spending on Cathay and HK Express)\nHK$2=1 mile\nMiles Conversion (Eligible spending on dining, online and overseas category)\nHK$4 = 1 mile\nBank Welcome Offer\n103,000 miles\n【SmartPoints - This This Choice - Your Rewards Your Choice】From now until 31 Jan 2024, Apply for Standard Chartered Cathy Mastercard now via MoneySmart to get Bowers & Wilkins PI5 S2 Headphone (value:$2,380) or 8,000 SmartPoints and free to redeem HK$800 vouchers (over 20+ brand vouchers including Apple / Wellcome/ HKTVmall etc)! SmartPoints can be converted into cash and cashed out directly!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusiveAs low as HK$0.5=1 Avios for welcome offer\nDah Sing British Airways Platinum Card\nMin. Annual Salary\nHK$150,000\nMiles Conversion (overseas spend)\n$6 = 1.5 Avios\nMiles Conversion (local spend)\n$6 = 1 Avios\n【MoneySmart Exclusive】From now until 31 January 2024, New Dah Sing Credit Cardholders are entitled to get an extra HK$100 PARKnSHOP supermarket voucher/ HKTVmall e-Voucher upon approval on the designated credit card (Dah Sing British Airways Platinum Card/ Dah Sing ANA World Mastercard. Dah Sing United MileagePlus World MasterCard)!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusive\nDah Sing ANA World Mastercard\nMin. Annual Salary\nHK$150,000\nMiles Conversion (overseas spend)\n$8 = 1 Mile\nMiles Conversion (local spend)\n$8 = 1 Mile\n【MoneySmart Exclusive】From now until 31 January 2024, New Dah Sing Credit Cardholders are entitled to get an extra HK$100 PARKnSHOP supermarket voucher/ HKTVmall e-Voucher upon approval on the designated credit card (Dah Sing British Airways Platinum Card/ Dah Sing ANA World Mastercard. Dah Sing United MileagePlus World MasterCard)!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nBank Promo\nFubon Visa Platinum Card\nMin. Annual Salary\nHK$60,000\nOnline Cash Rebate\n4%\nOverseas transaction rewards\n8%\nBank Promo:\nFrom now until 29 February 2024, successfully apply for Fubon Visa Platinum Credit Card through MoneySmart, with promotional code \"MoneySmart\", and spend HK$5,800 or above within the first 3 months from the date of card issuance to enjoy the cash rebate up to HK$500. \nYou can get an extra HK$100 Supermarket Coupon for applying via Fubon GO or online application form\nValid until 29 Feb 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusive\nAEON Card JAL\nMin. Annual Salary\nHK$0\nMiles Conversion (Local Dining & Japan Spending)\nHK$6 = 1 mile\nSelected merchants discount\n5%\n【Limited Time Offer】Welcome Offer up to HK$600 cashback! From now until 31 January 2024, successfully apply for a designated AEON Credit Card through MoneySmart, can enjoy an extra HK$200 Uber cash voucher or HK$200 Apple Store gift card! (exclusively offer by MoneySmart)!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nDBS Black American Express Card\nMin. Annual Salary\nHK$240,000\nMiles Conversion (overseas spend)\n$6 = 1 Mile\nMiles Conversion (local spend)\nN.A.\nread more\nMore Details\nmoneysmart exclusive\nDah Sing United MileagePlus World MasterCard\nMin. Annual Salary\nHK$150,000\nMiles Conversion (overseas spend)\nHK$5 = 1 mile\nMiles Conversion (local spend)\nHK$8 = 1 mile\n【MoneySmart Exclusive】From now until 31 January 2024, New Dah Sing Credit Cardholders are entitled to get an extra HK$100 PARKnSHOP supermarket voucher/ HKTVmall e-Voucher upon approval on the designated credit card (Dah Sing British Airways Platinum Card/ Dah Sing ANA World Mastercard. Dah Sing United MileagePlus World MasterCard)!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nCCB (Asia) AIA Credit Card\nMin. Annual Salary\nHK$150,000\nMiles Conversion (overseas spend)\nHK$15 = 1 mile\nMiles Conversion (local spend)\nHK$15 = 1 mile\nread more\nMore Details\neye Credit Card\nMin. Annual Salary\nHK$150,000\nMiles Conversion (overseas spend)\nHK$2.78 = 1 mile\nMiles Conversion (local spend)\nHK$3 = 1 mile\nread more\nMore Details\nBOC Hong Kong Airlines Visa Platinum Card\n最低年薪入息\nHK$150,000\nMiles Conversion (overseas spend)\nHK$4 = 1 mile\nMiles Conversion (local spend)\nHK$6 = 1 mile\nread more\nMore Details\nBOC SOGO Visa Signature Card\nMin. Annual Salary\nHK$300,000\nMiles Conversion (overseas spend)\nHK$8 = 1 mile\nMiles Conversion (local spend)\nHK$8 = 1 mile\nread more\nMore Details\nBOC Dual Currency Diamond Card\nMin. Annual Salary\nHK$200,000\nMiles Conversion (overseas spend)\nHK$8 = 1 mile\nMiles Conversion (local spend)\nHK$8 = 1 mile\nread more\nMore Details\nBank of Communications FWD Credit Card\nMin. Annual Salary\nHK$150,000\nMiles Conversion (overseas spend)\nHK$4 = 1 mile\nMiles Conversion (local spend)\nHK$8 = 1 mile\nread more\nMore Details\nBank of Communications Go-Goal Credit Card\n最低年薪入息\nHK$150,000\nMiles Conversion (overseas spend)\nHK$8 = 1 mile\nMiles Conversion (local spend)\nHK$8 = 1 mile\nread more\nMore Details\nLoad more results\nDisclaimer: At MoneySmart.hk, we strive to keep our information accurate and up to date. This information may be different than what you see when you visit a financial institution, service provider or specific product’s site. For any discrepancy in product information, please refer to the financial institution’s website for the most updated version. All financial products and services are presented without warranty. Additionally, this site may be compensated through third party advertisers. However, the results of our comparison tools which are not marked as sponsored are always based on objective analysis first.\nBest Air Miles Credit Cards Hong Kong 2023\nStandard Chartered Cathay Mastercard\n$4/mile Online shopping and dining\nDBS Black World Mastercard\n$4/mile Oversea spending and Avios earners\nCiti PremierMiles Card\n$3/mile Frequent overseas spenders who want free travel insurances\nAmerican Express® Platinum Credit Card\n$5/mile Movie Lovers\nCiti Rewards MasterCard\n$3/Mile Frequent digital wallets users\nHSBC EveryMile Credit Card\nHK$2 = 1 MIle Frequent overseas spenders who want free airport lounge entries\nWhat is the Best Credit Card for Air Miles?\nAsia Miles\nAmerican Express Cathay Pacific Elite Credit Card: Enjoy free access to Plaza Premium Lounge each year\nStandard Chartered Asia Miles Mastercard：Relatively high earning ratio of HK$4 = 1 mile\nCiti PremierMiles Card: HK$3 = 1 Mile on overseas and online foreign currency spending\nAvios\nDah Sing British Airways Platinum Card：HK$6 = 1 Avios on local spending\nDBS Black World Mastercard : HK$4 = 1 Avios on overseas spending\nAmerican Express Platinum Credit Card: HK $5 = 1 Avios on local spending\nANA Mileage Club\nDah Sing ANA World Mastercard：HK$8 = 1 mile on local and overseas transactions\nPopular Rewards Program for Air Miles Credit Cards\nBesides your spending habits, the type of air miles should be other criteria you consider while comparing air miles credit cards. Among all of the air miles programs, you need to pick one that best fits your travel and flying habits. If you take a certain airline very often, such as Cathay Pacific, you may want to pick an air miles program such as Asia Miles. Here are the most popular air miles programs in Hong Kong:\nAsia Miles\nAsia Miles allows you to redeem flight tickets from a diverse range of airlines, including Cathay Pacific and Qatar. You can redeem travel, entertainment, lifestyle, and other rewards with your air miles credit cards.\nAvios\nAvios in British Airways Executive Club is cheaper than Asia Miles when redeeming short flights. Plus, they offer a household accounts program, allowing you to earn Avios with your family members.\nANA Mileage Club\nANA’s mileage program lets you redeem flight tickets under Star Alliance. The strengths of ANA program are that they require fewer miles for flights to Japan and offer you a household account.\nBest Asia Miles Credit Cards\nAmerican Express Asia Miles\nHolder of American Express Platinum Credit Card can earn up to HK$1=3 points (capped at HK$120,000 spent) without prior registration. Points can be converted to Asia Miles\nHolders of American Express Cathay Pacific Card can earn HK$8 = 1 Asia Mile on all local purchases and HK$8 = 1.5 Asia Miles on foreign currency purchases (with no cap)\nHolders of American Express Cathay Pacific Elite Card can earn HK$6 = 1 Asia Mile on all local purchases and HK$6 = 1.5 Asia Miles on foreign currency purchases (with no cap)\nNo cap on earning Asia Miles\nConvert spending into Asia Miles automatically with no handling fee\nStandard Chartered Asia Miles\nWelcome offer: Up to 40,000 Asia Miles (up to HK$0.2 = 1 Asia Mile)\nHK$4 = 1 Asia Mile for eligible dining, online and foreign transactions. Even Octopus auto add value service can earn HK$6 = 1 Asia Mile\nEnjoy HK$1 = 1 Asia Mile on Mondays with Asia Miles partner restaurants\n2 days priority redemption for selected discount flight awards bookings online \n20% off Mileage Renewal fee, Mileage Transfer fee and purchase of Asia Miles Gift Miles\nMiles will be automatically credited to your Asia Miles account\nCitibank Asia Miles\nCiti PremierMiles Card: HK$8 = 1 Mile\nCiti Rewards Visa Card: HK$3 = 1 Mile\nCiti Prestige Card: HK$6 = 1 Mile\nBesides, eligible Citibank credit card holders can earn points for local and overseas spending, which can be transferred to 13 travel loyalty programs for free air tickets and hotel accommodations.\nThe conversion rate: 15 points=1 Asia Miles\nCardholders are required to transfer at minimum 18,000 points (equivalent to 1,200 Asia Miles) each time and each transfer must be made in 18,000 point increments\nHSBC RewardCash to Asia Miles\nStep 1\nFirst, enrol in the Mileage Programme for an annual membership fee of HK$300 and fill in your details in the online enrolment form with your Asia Miles membership number.\nStep 2\nThen, submit an application to transfer your RewardCash to Asia Miles either via HSBC internet banking or by post.\nStep 3\nGo to a participating airline’s or Asia Miles website to redeem the miles earned and choose your travel destinations.\nHow to earn and redeem Asia Miles\nYou need to first sign up as Asia Miles members. You can do so through their website or apps. Marco Polo Club members are automatically enrolled as Asia Miles members, with the same membership number.\nThen you can start earning your Asia Miles from your everyday spending.\nYou can join programs (Join Amex Turbo Programme to earn double points for every HK$1 spending) / spend on specific category/ spend on the designated day (enjoy HK$1 = 1 Asia Mile on Mondays with Asia Miles partner restaurants) to earn miles faster.\nFinally, you can start redeeming your Asia Miles. But it’s worth finding out the minimum amount of Asia Miles cardholders are required to redeem each time and the conversion fee.\nThings to Know Before Converting Air Miles\nAir Mile Converting Fee\nA handling fee of HK$100-300 is usually charged for each mileage conversion. Some airline or frequent-flyer co-branded credit cards such as BEA Flyer World Mastercard and Citi PremierMiles Card offer a handling fee waiver.\nProcessing Time\nPlease allow enough time for mileage credits to be credited to the Member’s account. It may take between 4-6 weeks for the credits to be reflected in your account balance.\nTaxes\nThe ticket prices under miles redemption programs exclude taxes and other fees such as the Air Passenger Departure Tax, the Passenger Security Charge, terminal building charges, and the Airport Construction Fee. The final price of a redeemed flight ticket will be adjusted based on your travel destination, which will be deducted from your credit card. Please note that different amount of air miles will be charged depending upon the seasons by air miles programs (e.g. Avios and ANA).\nFrequently Asked Questions\nWhat are the best asia miles credit cards?\nStandard Chartered Cathay Mastercard (HK$2 = 1 mile on Cathay and HK Express spending) and Citi Prestige Card (HK$4 = 1 mile on overseas spending) are popular Asia Miles credit cards choices.\nAre airline miles credit cards worth it?\nYes, if you are a frequent flyer who spends with a credit card. You earn air miles as you normally spend. When you have collected enough miles, you can redeem a free reward ticket. If you are a lower spender, credit cards which offer cash back/ points could be a better option than airline miles credit cards.\nWhich airline credit card is the easiest?\nStandard Chartered Asia Miles Credit Card is the easiest to apply because it only requires HK$96,000 annual income and it offers automatic mileage conversion with no conversion fee. It also offers a relatively high earning ratio of HK$4 = 1 Asia Mile on dining, online and overseas spending. But this card is only designed for collecting Asia Miles.\nHow do I redeem Air Miles for flights?\nYou will need to transfer the points you earned to air miles via internet banking first, in order to do so, you must be a member of one of the participating frequent flyer programs. After that you will be able to search and redeem for rewards fights with different destinations, date or classes, for partner airlines that can't be redeemed online, you may call the service hotline or submit a request form to make a redemption.\nHow many miles do you need to get a free flight?\nIt depends on your travel destination and the season you travel. But in order to redeem a free return ticket, you need to collect at least 12,000 Avios points for return tickets from Hong Kong to Taiwan.\nHow long do my air miles stay valid?\nAirline or air miles co-branded credit cards will automatically transfer the earned miles into your air miles account. For other credit cards, you need to transfer reward points into air miles yourself via e-banking or by calling the customer service hotline. Some credit cards may set an expiry date for reward points from 1-5 years (usually 2-3 years). But there are a few credit cards that have no expiry date on the points, such as DBS Black World Mastercard and American Express credit cards, giving you more time on earning points for flight tickets.\nAir miles have their own expiry date as well. For Asia Miles, redeemed miles in the account will no longer expire from 1 January 2020, as long as you earn or use the miles at least once every 18 months. Avios has a similar rule which expires after 36 months in an account with no activity.\nIs there anything I need to know while converting flight tickets with air miles?\nThe prices of flight tickets under miles redemption programs don’t include taxes and other fees, including the Air Passenger Departure Tax, the Passenger Security Charge, terminal building charges, and the Airport Construction Fee. The final price of a redeemed flight ticket will be adjusted based on your travel destination. The relevant extra costs will be deducted from your credit card. Note that some air miles programs (e.g. Avios and ANA) will set flight ticket prices based on seasons and charge you different amounts of air miles.\nHomeCredit CardsAir Miles\nAbout Careers Contact Us\nDisclaimer: At MoneySmart, MoneySmart HK Limited will do a variety of product listing services including but not limited to credit cards, personal loans, home loans and all products from virtual insurance companies.\nFollow us\n© 2009-2024 MoneySmart. All rights reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy.", "content_type": "text", "score": null, "meta": {"url": "https://www.moneysmart.hk/en/credit-cards/air-miles", "content_updated": true}, "id_hash_keys": ["content"], "embedding": null, "id": "889d18b36582b6af5951a50b5b7e916"}