{"content": "Best Credit Cards with Annual Fee Waiver in Hong Kong\nRead More\nFind Me A Card\nBest Credit Cards\nWelcome Offers\nCash Back\nAir Miles\nOnline Shopping\nOverseas Spending\nOctopus Card AAVS\nAnnual Fee Waiver\nBill Payment\nDining\nDebit Card\nUnionPay\nDigital Wallets\nBusiness Card\nStudent\nSupermarket\nPetrol\nEntertainment\nFilters\nPromotions\nApple Store Gift Card\nCard Association\nMastercard\nVisa\nUnionpay\nAmerican Express\nCredit Card Features\nAirport Lounge Access\n$0 Foreign Currency Transaction Fees\nNo Minimum Salary Requirement\nProviders\nAll Providers\nAEON Credit Service\nAirwallex\nAmerican Express\nBank of China\nBank of Communications\nBEA\nChina Construction Bank(Asia)\nCitibank\nChina CITIC Bank International\nDah Sing Bank\nDBS\nFubon Bank\nHang Seng Bank\nHSBC\nICBC\nlivi\nMox\nPrimeCredit\nsim\nStandard Chartered\nWeLab Bank\nClear All\nApply\nWe found 39 Credit Cards for you!\nmoneysmart exclusive5% rebate｜Waive foreign exchange fee\nStandard Chartered Smart Card\nCash back on spending at designated stores of HKTVmall\n5%\nCash back on local spend\n5%\nMoneySmart Exclusive Offer\n12,000 SmartPoints\n【SmartPoints - This This Choice - Your Rewards Your Choice】From now until 31 Jan 2024, New Cardholders who successfully apply for Standard Chartered Smart Card now via MoneySmart to get SAMSUNG Galaxy Tab A9+ Tablet or 12,000 SmartPoints and free to redeem HK$1,200 vouchers (over 20+ brand vouchers including Apple / Wellcome/ HKTVmall etc)! SmartPoints can be converted into cash and cashed out directly!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusiveRedeem various mileage points without any fee\nDBS Black World Mastercard\nMin. Annual Salary\nHK$240,000\nUpon meeting local and overseas spending goal*\nHK$3/mile\nAnnual Fee Waiver\nFirst-Year\n【Quick! Apply Today for Exclusive HomePod mini!】From now until 31 January, customers who successfully apply for DBS Blackworld Mastercard via MoneySmart, can enjoy a HomePod mini (retail price: HK$749) or HK$500 Apple Store Gift Card/ Klook Voucher/ PARKnSHOP Supermarket Voucher! You can also earn the bank welcome offer of up to 42,000 miles at the same time!\n\n\n【Apple fans - Attention!】Shop at Apple Store with Flexi Shopping on or before 15 Jan: Save on handling fees in 6 to 60-month installments and get a chance to win a 100% cash rebate on Apple Store spending!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusive\nWeWa UnionPay Diamond Card\nMin. Annual Salary\nHK$0\nCash back on overseas spend\n0.4%\nCash rebate on travel spending and designated spending categories\n4%\n【MoneySmart Exclusive Offer】 From now until 31 January 2024, new customers who successfully applied for WeWa UnionPay Diamond Card via MoneySmart, can enjoy 2,000 SmartPoints without further spending! You are free to choose vouchers of over 20+ brands (including Apple Store Gift Card, supermarket voucher, HKTVmall, Uber, Klook, etc.). Click here for more details. T&C applied. (fulfilled by MoneySmart)\n\n\n【PrimeCredit x MoneySmart】Successfully applied WeWa UnionPay Diamond Card through MoneySmart and earn extra HK$200 cash rebate + Welcome offer: Sony Truly Wireless Headphones LinkBuds S or Samsung Galaxy Watch4 40mm (Bluetooth) or B&O Beosound Explore Bluetooth Speaker (Black Anthracite) or HK$500 Cash Rebate or up to HK$90,000 Interest-free and Handling Fee-free Cash Instalment Program or Tertiary Student: HK$200 Cash Rebate (Exclusive reward will be fulfilled by PrimeCredit)\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusiveUp to 10% rebate on local supermarkets\nDBS COMPASS VISA\nMin. Annual Salary\nHK$100,000\nCash back on designated local spend\n1％\nMiles Conversion (local spend)\nHK$10 = 1 Mile\nFrom now until 31 January 2024, apply for designated cards through MoneySmart（DBS Eminent Card/ DBS Live Fresh/ DBS Compass Visa）successfully to get HK$200 Apple Store Gift Card or HK$200 Klook Gift Card or HK$200 ParknShop Voucher! \n\n\n【Apple fans - Attention!】Shop at Apple Store with Flexi Shopping on or before 15 Jan: Save on handling fees in 6 to 60-month installments and get a chance to win a 100% cash rebate on Apple Store spending!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusiveNo expiry date for Membership Rewards points\nAmerican Express Explorer® Credit Card\nMin. Annual Salary\nHK$300,000\nComplimentary Plaza Premium Lounge Access\n8 times per Calendar Year\nAnnual Fee Waiver\nFirst-Year\n【⚡️Limited-Time offer of HK$500 Statement Credit】From now on until 31 January, customers who successfully apply for the American Express Explorer Credit Card via MoneySmart can earn 🔥additional HK$500 statement credit when completing the first transaction within the first 3 months, and up to 126,000 American Express Membership Rewards points upon the qualified spending of HK$7,000 within the first 3 months! Spend 7,000 and Earn 7,000 Miles! Plus, you can enjoy 8 complimentary lounge passes for a whole year!\n\n\nUnlock Your Mileage Bonanza! Earn HK$2=1 mile on eligible foreign currency transactions, up to 720,000 Points, enough to redeem for 40,000 miles. Plus, earn HK$4.5=1 mile on eligible local transactions, up to 432,000 Points, enough to redeem for 24,000 miles. That's a potential of up to 64,000 bonus miles - plan your European getaway with your free round-trip ticket!\n\n\n【🌟Attention Eletronic Shoppers!】Looking to take your electronic or Apple product purchases to the next level? The Explorer Card has got you covered! You’ll enjoy an extended 1-year warranty on any purchase; plus earn 5 Membership Rewards points for every eligible HK$1 spent at the Apple Online Store. Seize the chance and APPLY NOW!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusive\nStandard Chartered Cathay Mastercard\nMiles Conversion(Eligible spending on Cathay and HK Express)\nHK$2=1 mile\nMiles Conversion (Eligible spending on dining, online and overseas category)\nHK$4 = 1 mile\nBank Welcome Offer\n63,000 miles\n【SmartPoints - This This Choice - Your Rewards Your Choice】From now until 31 Jan 2024, Apply for Standard Chartered Cathy Mastercard now via MoneySmart to get Bowers & Wilkins PI5 S2 Headphone (value:$2,380) or 8,000 SmartPoints and free to redeem HK$800 vouchers (over 20+ brand vouchers including Apple / Wellcome/ HKTVmall etc)! SmartPoints can be converted into cash and cashed out directly!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusiveEarn 2% cashback from everyday spending\nEarnMORE UnionPay Diamond Card\n【MoneySmart Exclusive Offer】From now until 31 January 2024, new customers who successfully applied for EarnMORE UnionPay Diamond Card via MoneySmart, can enjoy 2,000 SmartPoints without further spending! You are free to choose vouchers of over 20+ brands (including Apple Store Gift Card, supermarket voucher, HKTVmall, Uber, Klook, etc.). Click here for more details. T&C applied. (fulfilled by MoneySmart)\n\n\n[PrimeCredit x MoneySmart] Apply EarnMORE UnionPay Diamond Card through MoneySmart and earn extra HK$200 cash rebate + Welcome offer: HK$670 cash rebate (included the extra up to 2% cash rebate) Or  OTO Vanda 2.0 massage chair (VN-05) (Suggested price: HK$13,800) Or German Pool Smart Air Purifier Fan (EFB-426HM-SC) (Suggested price: HK$2,480) Or Up to HK$90K Interest-free and Handling Fee-free Cash Instalment Program (Extra reward will be fulfilled by PrimeCredit)\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusive\nStandard Chartered Cathay Mastercard - Priority Private\nMiles Conversion(Eligible spending on Cathay and HK Express)\nHK$2=1 mile\nMiles Conversion (Eligible spending on dining, online and overseas category)\nHK$4 = 1 mile\nBank Welcome Offer\n103,000 miles\n【SmartPoints - This This Choice - Your Rewards Your Choice】From now until 31 Jan 2024, Apply for Standard Chartered Cathy Mastercard now via MoneySmart to get Bowers & Wilkins PI5 S2 Headphone (value:$2,380) or 8,000 SmartPoints and free to redeem HK$800 vouchers (over 20+ brand vouchers including Apple / Wellcome/ HKTVmall etc)! SmartPoints can be converted into cash and cashed out directly!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nCNCBI GBA Dual Currency Credit Card\nMin. Annual Salary\nHK$96,000\nAll year round Cash rebate on WeChat HK Wallet, UnionPay App and RMB Spending\n4%\nBasic Cash Back\n0.5%\napply now\nMore Details\nmoneysmart exclusive\nStandard Chartered Cathay Mastercard - Priority Banking\nMiles Conversion(Eligible spending on Cathay and HK Express)\nHK$2=1 mile\nMiles Conversion (Eligible spending on dining, online and overseas category)\nHK$4 = 1 mile\nBank Welcome Offer\n83,000 miles\n【SmartPoints - This This Choice - Your Rewards Your Choice】From now until 31 Jan 2024, Apply for Standard Chartered Cathy Mastercard now via MoneySmart to get Bowers & Wilkins PI5 S2 Headphone (value:$2,380) or 8,000 SmartPoints and free to redeem HK$800 vouchers (over 20+ brand vouchers including Apple / Wellcome/ HKTVmall etc)! SmartPoints can be converted into cash and cashed out directly!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusive3 Complimentary airport lounges access per year\nEarnMORE UnionPay Diamond Card (applicable to designated Full-time University /Tertiary Students)\nMin. Annual Salary\nHK$0\nCash back on local or oversea spending\n2％\nAnnual Fee Waiver\nFirst 5 Years\n【MoneySmart Exclusive Offer】From now until 31 January 2024, new customers who successfully applied for EarnMORE UnionPay Diamond Card via MoneySmart, can enjoy 2,000 SmartPoints without further spending! You are free to choose vouchers of over 20+ brands (including Apple Store Gift Card, supermarket voucher, HKTVmall, Uber, Klook, etc.). Click here for more details. T&C applied. (fulfilled by MoneySmart)\n\n\n[PrimeCredit x MoneySmart] Apply EarnMORE UnionPay Diamond Card through MoneySmart and earn extra HK$200 cash rebate + Welcome offer: HK$670 cash rebate (included the extra up to 2% cash rebate) Or  OTO Vanda 2.0 massage chair (VN-05) (Suggested price: HK$13,800) Or German Pool Smart Air Purifier Fan (EFB-426HM-SC) (Suggested price: HK$2,480) Or Up to HK$90K Interest-free and Handling Fee-free Cash Instalment Program (Extra reward will be fulfilled by PrimeCredit)\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nFree travel insurance and airport lounges access\nCiti PremierMiles Card\nMinimum Income Requirements\nHK$120,000\nRewards on local spend\nHK$8 = 1 mile\nAnnual Fee Waiver\nFirst-Year\nread more\nMore Details\nCNCBI Motion Credit Card\nMin. Annual Salary\nHK$96,000\nCash Back on Dining, Online and Foreign Currency Spending\n6%\nAnnual Fee Wavier\nFirst-Year\napply now\nMore Details\nmoneysmart exclusiveGet 6% +FUN Dollars on overseas spending\nHang Seng MMPOWER World Mastercard®\nAnnual Fee\nPerpetual annual fee waiver\n+FUN Dollars rebate on Overseas Foreign Currencies Spending\n6%\n+FUN Dollars rebate on Online Retail Transaction\n5%\n【The Wait is Over! MMPOWER is Back with a Limited-time Offer!】\nFrom now until 9 February, new credit card customers* who successfully applied for the MMPOWER World Mastercard via MoneySmart simply spend HK$800 within 30 days after card issuance, can enjoy an extra Dreame Hair Glory High-Speed Hair Dryer (Retail Price: HK$1,199) or HK$800 Apple Store Gift Card or HK$800 PARKnSHOP Supermarket vouchers or HK$800 Klook Coupon! You can also enjoy up to $700 +FUN Dollars welcome offer upon meeting the designated spending requirements!\n\n\n【MMPOWER Super Deal】From now until 30 June, 2024, customers who earn 6% +FUN Dollars in overseas foreign currencies spending, 5% +FUN Dollars in online retail spending and 1% +FUN Dollars in your selected spending categories upon meeting accumulative monthly eligible retail spending of HKD5,000, can earn up to $500 +FUN Dollars per month!\nValid until 09 Feb 2024 - See more details below\napply now\nMore Details\nUnlimited cashback\nStandard Chartered Simply Cash Visa Card\nMin. Annual Salary\nHK$96,000\nRewards on local spend\n1.5% Cashback\nAnnual Fee Waiver\nFirst-Year\nread more\nMore Details\n2% foreign currency rebate\nCiti Cash Back Card\nMinimum Income Requirements\nHK$120,000\nRewards on local spend\n2% Cashback\nAnnual Fee Waiver\nFirst-Year\nread more\nMore Details\n5x Points on contactless transactions\nCiti Rewards MasterCard\nMinimum Income Requirements\nHK$120,000\nWallet transactions(Apple Pay、 Google Pay and Samsung Pay)\n5X points\nAnnual Fee Waiver\nFirst-Year\nread more\nMore Details\nUp to 15% transport fare rebate\nCiti Octopus Platinum Card\nMinimum Income Requirements\nHK$120,000\nRewards on local spend\n0.5% Cashback\nAnnual Fee Waiver\nFirst-Year\nread more\nMore Details\nmoneysmart exclusive\nDah Sing ONE+ Credit Card\nMin. Annual Salary\nHK$150,000\nRewards on local spend\n1% Cashback\nAnnual Fee Waiver\nFirst 2 Years\n【Welcome offer Exclusive for MoneySmart Users】From now until 31 January 2024,  New Dah Sing Credit Cardholder to get extra HK$150 PARKnSHOP supermarket vouchers or HKTVmall e-Voucher upon approval on the credit card! Total up to HK$650 rewards including Dah Sing Bank welcome offer. \n\n\nEach Eligible Cardholder is entitled to HK$500 cash rebate upon accumulating Eligible Spending of HKD5,000 or above, and making at least 5 Eligible Spending transactions, within the first 2 months from the date of the Bank's issuance of the Eligible Card.\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nUp to 25% discount at I.T\nAmerican Express I.T Cashback Card\nMin. Annual Salary\nHK$150,000\nRewards on local spend\n1.2% Cashback\nAnnual Fee Waiver\nFirst-Year\nread more\nMore Details\nLoad more results\nDisclaimer: At MoneySmart.hk, we strive to keep our information accurate and up to date. This information may be different than what you see when you visit a financial institution, service provider or specific product’s site. For any discrepancy in product information, please refer to the financial institution’s website for the most updated version. All financial products and services are presented without warranty. Additionally, this site may be compensated through third party advertisers. However, the results of our comparison tools which are not marked as sponsored are always based on objective analysis first.\nSelected Credit Cards with Perpetual Annual Fee Waivers\nHang Seng MPOWER Card\nHK$150,000 5% cash dollars rebate on mobile payment, online shopping, and overseas transactions\nHSBC Red Credit Card\nHK$120,000 4% cashback on online purchases\nBOC Dual Currency Diamond Card\nHK$200,000 4% cashback on the mobile payment transaction\nCredit Cards with Annual Fee Waivers for New Customers\nCiti Cash Back Card\nFirst Year HK$1,800\nCiti PremierMiles Card\nFirst Year HK$1,800\nCiti Rewards MasterCard\nFirst Year HK$1,800\nDBS Eminent Visa Platinum Card\nFirst Year HK$1,800\nDBS COMPASS VISA\nFirst Year HK$1,800\nDBS Black World Mastercard\nFirst Year HK$2,000\nBlue Cash℠ Credit Card from American Express\nFirst Year (Enjoy annual fee waiver for subsequent years for spending HK$25,000 or above annually) HK$980\nAmerican Express Cathay Pacific Elite Credit Card\nFirst Year HK$1,800\nStandard Chartered Asia Miles Mastercard\nFirst Year HK$2,000\nStandard Chartered Simply Cash Visa Card\nFirst Year HK$2,000\nEarnMORE UnionPay Card\nFirst Two Years/ First Five Years (Student Card) HK$800\nWeWa UnionPay Card\nFirst Two Years/ First Five Years (Student Card) HK$800\nWhat is an annual fee?\nThe annual fee is a cost that your credit card provider charges yearly to keep the card active and allows you to enjoy the card benefits. In most cases, credit cards with a higher annual fee provide more benefits.\nOther Ways to Waive the Annual Fee\nMeet the minimum spend requirement\nSome credit cards will only waive annual fees if a minimum spending requirement is met. If it is not specified, cardholders can usually get it waived as long as there has been a transaction.\nCall customer hotline\nCardholders can call credit card issuers at the 11th month after card issuance to request an annual fee waiver. You can also call after you have been charged. This can usually be done over the automated service over the phone 24 hours a day.\nBecome designated customers\nSome banks offer an annual fee waiver for designated members. For example, American Express Cathay Pacific Elite Credit Card offers an annual fee waiver for Marco Polo Club members.\nRedeem points for an annual fee waiver\nCardholders can also redeem points earned for the annual fee waiver. But before you do this, it is better to call the customer service hotline to check if you can get it waived first.\nCredit Cards with Annual Fee that Cannot Be Waived\nSome premium credit cards which include Citi Prestige Credit Card and The Platinum Card do not accept annual fee waiver requests. These types of credit cards are characterized by exclusive offers. Citi Prestige charges HK$3,800 annual fee. Cardholders can enjoy complimentary global airport lounge access and complimentary 4th night at any hotel. The nonwaivable annual fee of the Platinum Card is HK$7,800. Cardholders can enjoy 1,200+ lounges access all over the world and exclusive access to the Centurion Lounges and complimentary travel insurance, etc.\nFAQ\nWhat is the HSBC customer service hotline for credit card annual fee waiver?\nYou can call HSBC Credit Card Customer Service Hotline at +852 2233 3000 to try getting your credit card annual fee waived.\nHow to waive DBS credit card annual fee?\nYou can call DBS Credit Card Customer Service Hotline at +852 2290 8345 to request an annual fee waiver.\nWhat should applicants be aware of when applying for credit cards with perpetual annual fee waivers?\nApplicant should check if the annual fee waivers apply to all applicants and whether it is applicable to both principal and supplementary cardholders. For example, Standard Chartered Simply Cash only offers a perpetual annual fee waiver to holders of priority banking/premium banking/bonus payroll. Moreover, it is only exclusive for principal cardholders. In other words, if you would like to apply for a supplementary card, you will need to pay for the annual fee for the extra card.\nDo I have to pay an annual fee even if I don’t use the credit card anymore?\nYes, the annual fee will be charged regardless of the credit card activity, but you may ask the credit card issuer to see if you can apply for a credit card annual fee waiver, or you may also consider cancelling your credit card if you no longer use its benefits.\nWhat is the definition of a new customer when applying credit cards?\nMost of the credit cards only offer an annual fee waiver to new customers, but different banks have their own definition for a new customer. Take Citibank as an example, customers who currently do not hold, have not cancelled or have not held any principal card of Citi Credit Card within the past 12 months will be considered as a new customer, but for Standard Chartered, applicants who do not currently hold and have not cancelled any principal card of Standard Chartered credit card in the past 6 months will be eligible to get the new customer offer.\nHomeCredit CardsAnnual Fee Waiver\nAbout Careers Contact Us\nDisclaimer: At MoneySmart, MoneySmart HK Limited will do a variety of product listing services including but not limited to credit cards, personal loans, home loans and all products from virtual insurance companies.\nFollow us\n© 2009-2024 MoneySmart. All rights reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy.", "content_type": "text", "score": null, "meta": {"url": "https://www.moneysmart.hk/en/credit-cards/annual-fee-waiver", "content_updated": true}, "id_hash_keys": ["content"], "embedding": null, "id": "d53ee2cf1c51454a4f877636baf26b37"}