{"content": "Best Travel and Overseas Spending Credit Cards in HK | MoneySmart\nRead More\nFind Me A Card\nBest Credit Cards\nWelcome Offers\nCash Back\nAir Miles\nOnline Shopping\nOverseas Spending\nOctopus Card AAVS\nAnnual Fee Waiver\nBill Payment\nDining\nDebit Card\nUnionPay\nDigital Wallets\nBusiness Card\nStudent\nSupermarket\nPetrol\nEntertainment\nFilters\nPromotions\nApple Store Gift Card\nCard Association\nMastercard\nVisa\nUnionpay\nAmerican Express\nCredit Card Features\nAirport Lounge Access\n$0 Foreign Currency Transaction Fees\nNo Minimum Salary Requirement\nProviders\nAll Providers\nAEON Credit Service\nAirwallex\nAmerican Express\nBank of China\nBank of Communications\nBEA\nChina Construction Bank(Asia)\nCitibank\nChina CITIC Bank International\nDah Sing Bank\nDBS\nFubon Bank\nHang Seng Bank\nHSBC\nICBC\nlivi\nMox\nPrimeCredit\nsim\nStandard Chartered\nWeLab Bank\nClear All\nApply\nWe found 47 Credit Cards for you!\nmoneysmart exclusive5% rebate｜Waive foreign exchange fee\nStandard Chartered Smart Card\nCash back on spending at designated stores of HKTVmall\n5%\ncash back on local spend\n5%\nMoneySmart Exclusive Offer\n12,000 SmartPoints\n【SmartPoints - This This Choice - Your Rewards Your Choice】From now until 31 Jan 2024, New Cardholders who successfully apply for Standard Chartered Smart Card now via MoneySmart to get SAMSUNG Galaxy Tab A9+ Tablet or 12,000 SmartPoints and free to redeem HK$1,200 vouchers (over 20+ brand vouchers including Apple / Wellcome/ HKTVmall etc)! SmartPoints can be converted into cash and cashed out directly!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusiveRedeem various mileage points without any fee\nDBS Black World Mastercard\nMin. Annual Salary\nHK$240,000\nMiles Conversion (overseas spend)\n$4 = 1 mile\nCash back (overseas spend)\nHK$6 = 1 mile\n【Quick! Apply Today for Exclusive HomePod mini!】From now until 31 January, customers who successfully apply for DBS Blackworld Mastercard via MoneySmart, can enjoy a HomePod mini (retail price: HK$749) or HK$500 Apple Store Gift Card/ Klook Voucher/ PARKnSHOP Supermarket Voucher! You can also earn the bank welcome offer of up to 42,000 miles at the same time!\n\n\n【Apple fans - Attention!】Shop at Apple Store with Flexi Shopping on or before 15 Jan: Save on handling fees in 6 to 60-month installments and get a chance to win a 100% cash rebate on Apple Store spending!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusiveNo expiry date for Membership Rewards points\nAmerican Express Explorer® Credit Card\nMin. Annual Salary\nHK$300,000\nMiles Conversion (Eligible Foreign Currency Transaction)*\nHK$2 = 1 Mile\nMiles Conversion (Eligible Local Transaction)*\nHK$4.5 = 1 Mile\n【⚡️Limited-Time offer of HK$500 Statement Credit】From now on until 31 January, customers who successfully apply for the American Express Explorer Credit Card via MoneySmart can earn 🔥additional HK$500 statement credit when completing the first transaction within the first 3 months, and up to 126,000 American Express Membership Rewards points upon the qualified spending of HK$7,000 within the first 3 months! Spend 7,000 and Earn 7,000 Miles! Plus, you can enjoy 8 complimentary lounge passes for a whole year!\n\n\nUnlock Your Mileage Bonanza! Earn HK$2=1 mile on eligible foreign currency transactions, up to 720,000 Points, enough to redeem for 40,000 miles. Plus, earn HK$4.5=1 mile on eligible local transactions, up to 432,000 Points, enough to redeem for 24,000 miles. That's a potential of up to 64,000 bonus miles - plan your European getaway with your free round-trip ticket!\n\n\n【🌟Attention Eletronic Shoppers!】Looking to take your electronic or Apple product purchases to the next level? The Explorer Card has got you covered! You’ll enjoy an extended 1-year warranty on any purchase; plus earn 5 Membership Rewards points for every eligible HK$1 spent at the Apple Online Store. Seize the chance and APPLY NOW!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusive\nWeWa UnionPay Diamond Card\nMin. Annual Salary\nHK$0\nCash back on overseas spend\n0.4%\nCash rebate on travel spending and designated spending categories\n4%\n【MoneySmart Exclusive Offer】 From now until 31 January 2024, new customers who successfully applied for WeWa UnionPay Diamond Card via MoneySmart, can enjoy 2,000 SmartPoints without further spending! You are free to choose vouchers of over 20+ brands (including Apple Store Gift Card, supermarket voucher, HKTVmall, Uber, Klook, etc.). Click here for more details. T&C applied. (fulfilled by MoneySmart)\n\n\n【PrimeCredit x MoneySmart】Successfully applied WeWa UnionPay Diamond Card through MoneySmart and earn extra HK$200 cash rebate + Welcome offer: Sony Truly Wireless Headphones LinkBuds S or Samsung Galaxy Watch4 40mm (Bluetooth) or B&O Beosound Explore Bluetooth Speaker (Black Anthracite) or HK$500 Cash Rebate or up to HK$90,000 Interest-free and Handling Fee-free Cash Instalment Program or Tertiary Student: HK$200 Cash Rebate (Exclusive reward will be fulfilled by PrimeCredit)\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusive\nAEON CARD WAKUWAKU\nMin. Annual Salary\nHK$0\nCash back on online shopping\n6%\nCash back on local spending (dinning)\n1%\n【Limited Time Offer】From now until 31 January 2024, apply for the AEON CARD WAKU WAKU through MoneySmart, can enjoy an extra HK$200 Uber cash voucher or HK$200 Apple Store gift card (exclusively offer by MoneySmart)!\n\n\nNew AEON Customers successfully applied AEON CARD WAKUWAKU through “AEON HK” mobile app and input the welcome offer code “MSWAKU” to enjoy extra HK$200 cash rebate (Offer by AEON).\n\nYou can also enjoy the welcome Offer - up to 16% cashback + HK$400 cashback! Enjoy a year-round 6% cashback on online spending! Earn 3% cashback on purchases in Japan and enjoy waived transaction fees on foreign currency\ntransactions (except charges imposed by Cards Associations)!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusive\nStandard Chartered Cathay Mastercard - Priority Banking\nMiles Conversion(Eligible spending on Cathay and HK Express)\nHK$2=1 mile\nMiles Conversion (Eligible spending on dining, online and overseas category)\nHK$4 = 1 mile\nBank Welcome Offer\n83,000 miles\n【SmartPoints - This This Choice - Your Rewards Your Choice】From now until 31 Jan 2024, Apply for Standard Chartered Cathy Mastercard now via MoneySmart to get Bowers & Wilkins PI5 S2 Headphone (value:$2,380) or 8,000 SmartPoints and free to redeem HK$800 vouchers (over 20+ brand vouchers including Apple / Wellcome/ HKTVmall etc)! SmartPoints can be converted into cash and cashed out directly!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusiveGet 6% +FUN Dollars on overseas spending\nHang Seng MMPOWER World Mastercard®\nAnnual Fee\nPerpetual annual fee waiver\n+FUN Dollars rebate on Overseas Foreign Currencies Spending\n6%\n+FUN Dollars rebate on Online Retail Transaction\n5%\n【The Wait is Over! MMPOWER is Back with a Limited-time Offer!】\nFrom now until 9 February, new credit card customers* who successfully applied for the MMPOWER World Mastercard via MoneySmart simply spend HK$800 within 30 days after card issuance, can enjoy an extra Dreame Hair Glory High-Speed Hair Dryer (Retail Price: HK$1,199) or HK$800 Apple Store Gift Card or HK$800 PARKnSHOP Supermarket vouchers or HK$800 Klook Coupon! You can also enjoy up to $700 +FUN Dollars welcome offer upon meeting the designated spending requirements!\n\n\n【MMPOWER Super Deal】From now until 30 June, 2024, customers who earn 6% +FUN Dollars in overseas foreign currencies spending, 5% +FUN Dollars in online retail spending and 1% +FUN Dollars in your selected spending categories upon meeting accumulative monthly eligible retail spending of HKD5,000, can earn up to $500 +FUN Dollars per month!\nValid until 09 Feb 2024 - See more details below\napply now\nMore Details\nBank Promo\nFubon Visa Platinum Card\nMin. Annual Salary\nHK$60,000\nOnline Cash Rebate\n4%\nOverseas transaction rewards\n8%\nBank Promo:\nFrom now until 29 February 2024, successfully apply for Fubon Visa Platinum Credit Card through MoneySmart, with promotional code \"MoneySmart\", and spend HK$5,800 or above within the first 3 months from the date of card issuance to enjoy the cash rebate up to HK$500. \nYou can get an extra HK$100 Supermarket Coupon for applying via Fubon GO or online application form\nValid until 29 Feb 2024 - See more details below\napply now\nMore Details\nCNCBI Motion Credit Card\nMin. Annual Salary\nHK$96,000\nCash Back on Dining, Online and Foreign Currency Spending\n6%\nAnnual Fee Wavier\nFirst-Year\napply now\nMore Details\nmoneysmart exclusive8% cashback on online retail transactions*\nsim Credit Card\nCashback on Online Retail Transactions\n8%\nFee Waiver\nFirst Year Free\nMinimum Income Requirements\nN/A\n【🔥Hottest Deal in Town: Earn a HomePod Mini and Supercharge Your Welcome Offer!】\nFrom now until 31 January 2024, customers apply for a designated sim credit card through MoneySmart (sim Credit Card/ sim World Mastercard®️) successfully to get a HomePod mini (Retail Price: HK$749) or HK$500 Apple Store Gift Card/ PARKnSHOP Voucher/ HKTVmall E-vouchers! Including the welcome offer, you can enjoy up to HK$1,249 rewards in total!\n\n\n💡Quick Reminder: Speed up your approval process - After completing your online application, please screenshot your reference ID (which should be 88-XXXXXXXXX-X-03XX-thesim), and conduct digital ID verification on the sim Credit Card App. Complete the verification within 3 hours after application, and sim will offer an additional HK$50 cash rebate!\nValid until 31 Jan 2024 - See more details below\napply now\nApply directly on MoneySmart\nMore Details\nmoneysmart exclusive\nStandard Chartered Cathay Mastercard - Priority Private\nMiles Conversion(Eligible spending on Cathay and HK Express)\nHK$2=1 mile\nMiles Conversion (Eligible spending on dining, online and overseas category)\nHK$4 = 1 mile\nBank Welcome Offer\n103,000 miles\n【SmartPoints - This This Choice - Your Rewards Your Choice】From now until 31 Jan 2024, Apply for Standard Chartered Cathy Mastercard now via MoneySmart to get Bowers & Wilkins PI5 S2 Headphone (value:$2,380) or 8,000 SmartPoints and free to redeem HK$800 vouchers (over 20+ brand vouchers including Apple / Wellcome/ HKTVmall etc)! SmartPoints can be converted into cash and cashed out directly!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nCNCBI GBA Dual Currency Credit Card\nMin. Annual Salary\nHK$96,000\nAll year round Cash rebate on WeChat HK Wallet, UnionPay App and RMB Spending\n4%\nBasic Cash Back\n0.5%\napply now\nMore Details\nCiti Welcome Offer: 30,000 Miles\nCiti Prestige Card\nMinimum Income Requirements\nHK$600,000\nMiles Conversion (overseas spend)\n$4 = 1 mile\nCash back (overseas spend)\nN/A\nread more\nMore Details\nmoneysmart exclusive\nDBS LIVE FRESH\nMin. Annual Salary\nHK$150,000\nCash back on Online Overseas spend\n1%\nDesignated Cash Back for Online Transaction\n6%\nFrom now until 31 January 2024, apply for designated cards through MoneySmart（DBS Eminent Card/ DBS Live Fresh/ DBS Compass Visa）successfully to get HK$200 Apple Store Gift Card or HK$200 Klook Gift Card or HK$200 ParknShop Voucher! \n\n\n【Apple fans - Attention!】Shop at Apple Store with Flexi Shopping on or before 15 Jan: Save on handling fees in 6 to 60-month installments and get a chance to win a 100% cash rebate on Apple Store spending!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nCiti The Club\nMoneySmart Limited Time Offer\nHK$1,000\nCash back on local spending (Designated HKT merchants and Designated Merchants)\n4%\nCash back on other local spending\n1%\nread more\nMore Details\nmoneysmart exclusive\nWeWa UnionPay Diamond Card (applicable to designated Full-time University /Tertiary Students)\nMin. Annual Salary\nHK$0\nCash back on overseas spend\n0.4%\nCash rebate on travel spending and designated spending categories\n4%\n【MoneySmart Exclusive Offer】 From now until 31 January 2024, new customers who successfully applied for WeWa UnionPay Diamond Card via MoneySmart, can enjoy 2,000 SmartPoints without further spending! You are free to choose vouchers of over 20+ brands (including Apple Store Gift Card, supermarket voucher, HKTVmall, Uber, Klook, etc.). Click here for more details. T&C applied. (fulfilled by MoneySmart)\n\n\n【PrimeCredit x MoneySmart】Successfully applied WeWa UnionPay Diamond Card through MoneySmart and earn extra HK$200 cash rebate + Welcome offer: Sony Truly Wireless Headphones LinkBuds S or Samsung Galaxy Watch4 40mm (Bluetooth) or B&O Beosound Explore Bluetooth Speaker (Black Anthracite) or HK$500 Cash Rebate or up to HK$90,000 Interest-free and Handling Fee-free Cash Instalment Program or Tertiary Student: HK$200 Cash Rebate (Exclusive reward will be fulfilled by PrimeCredit)\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusive\nAEON UnionPay Credit Card\nMin. Annual Salary\nHK$0\nCash back on overseas spend\n0.4%\nCash back on selected merchants\n5%\n【Limited Time Offer】Welcome Offer up to HK$600 cashback! From now until 31 January 2024, successfully apply for a designated AEON Credit Card through MoneySmart, can enjoy an extra HK$200 Uber cash voucher or HK$200 Apple Store gift card! (exclusively offer by MoneySmart)!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nFree travel insurance and airport lounges access\nCiti PremierMiles Card\nWelcome Offer\n9,000 Miles (108,000 Points)\nMinimum Income Requirements\nHK$120,000\nMiles Conversion (overseas spend)\n$3 = 1 Mile\nread more\nMore Details\nmoneysmart exclusiveEnhanced Welcome Offer\nThe Platinum Card\nMiles Conversion (Overseas Spending)\nHK$6 = 1 Mile\nDiscount at designated restaurants\nHK$9 = 1 Mile\nDiscount at designated restaurants\n40%\n【The Ultimate Choice for High-Spending Mileage: New Year New Offer - Enjoy up to 55,555 Miles!】\nFrom now till January 31, 2024, customers who successfully apply for the Platinum Card via MoneySmart and complete the first transaction within the first 3 months, can earn 100,000 Membership Rewards points + [Limited-time exclusive🔥] additional HK$1,000 statement credit; With aggregate spending of HK$50,000 can enjoy extra 900,000 Membership Rewards points! Up to 1,000,000 Membership Rewards points in total!\n\n\nEquivalent to HK$3,333 statement credit or HK$6,666 travel credit or 55,555 air miles, which is sufficient to redeem round trip tickets to Japan for two or round trip tickets to Europe!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nmoneysmart exclusiveUncapped 1% rebate on foreign currencies expenses\nAmerican Express Gold Business Card\nAnnual Principal Fee\nAnnual Fee Waiver in First Year\nForeign Currency Spending Bonus\nUp to 3X points^\nLocal Spending Bonus\nUp to 2X points^\n【Double You Spending Power: Get HK$1,000 for HK$1,000 Spent!】\nCustomers who successfully apply for the American Express Gold Business Card through MoneySmart and make their first transaction within the first three months, accumulating a total of HK$1000 in spending, can receive up to HK$1,000 statement credit!\n\n【Welcome Bonus Rewards】\nBy accumulating a total of HK$45,000 in spending within the first three months, you can enjoy an additional 315,000 points (which can be redeemed for HK$1,050 Pay with Points or 17,500 miles)!\n\n【Merchant Rewards for Corporate Customers】\nCustomers who make transactions at designated merchant partners within the first three months can enjoy an additional 5X points, with the potential to earn up to 225,000 points (which can be redeemed for HK$750 Pay with Points or 12,500 miles)!\nValid until 31 Jan 2024 - See more details below\napply now\nMore Details\nLoad more results\nDisclaimer: At MoneySmart.hk, we strive to keep our information accurate and up to date. This information may be different than what you see when you visit a financial institution, service provider or specific product’s site. For any discrepancy in product information, please refer to the financial institution’s website for the most updated version. All financial products and services are presented without warranty. Additionally, this site may be compensated through third party advertisers. However, the results of our comparison tools which are not marked as sponsored are always based on objective analysis first.\nBest Travel / Overseas Spending Credit Cards in Hong Kong 2023\nHSBC Visa Signature Card\nEnjoy up to 9X RewardCash HK$360,000\nCiti PremierMiles Card\nHK$3= 1 mile on foreign transaction HK$240,000\nDBS Black World Mastercard\nHK$4= 1 mile on foreign transaction HK$240,000\nWeWa UnionPay Card\n4% cashback HK$0\nStandard Chartered Asia Miles Mastercard\nHK$4= 1 mile on foreign transaction HK$96,000\nAmerican Express Cathay Pacifit Credit Card\nHK$8= 1.5 miles on foreign transaction HK$150,000\nForeign Transaction Fee\nCredit cardholders will be charged foreign transaction fees for transactions made in foreign countries during your travel and through online shopping. The charge ranges from 1-2%, depending on the card issuer. JCB charges 1-1.95%, American Express charges 2% while Visa/ Mastercard issued by local banks charge 1.95% for each foreign transaction.\nWhile most of the Union Pay credit cards (excluding Hang Seng and HSBC) exempt cardholders from overseas charges, the exchange rate is usually higher than Visa/ Mastercard. Moreover, the rewards of Visa/Mastercard are often more attractive. Therefore, when deciding which credit card to use during your travel, it is not wise to only consider the transaction fee. It is best to consider all factors including transaction fee, exchange rate, card rebate, etc. to be smart with money.\nCredit Card Overseas Charges- DCC Markup Fee\nCredit card overseas charges do not only apply to foreign transactions made in foreign countries while travelling, and it also applies to transactions made online from your home country where the vendor is in an oversea country. Very often, merchants will provide you with the option to either pay in local currency or Hong Kong currency. If you decide to pay in Hong Kong currency, you will be charged at least a 4% DCC markup fee (Dynamic Currency Conversion (DCC) Service Charges). To avoid that, you should always pay in local currencies wherever possible.\nCredit Card Travel Promotions\nHang Seng Credit Card\nFrom now until 31 December 2022, spend HK$5,000 or above with the registered Hang Seng Credit Card including Hang Seng Visa Infinite Card / Hang Seng Prestige World to enjoy up to 6% Cash Dollars rebate.\nBOC Credit Card\nWith BOC Travel Rewards Visa Signature Card, you can enjoy up to 8% rebate for overseas spending throughout the year, and a maximum of HK$500 cash rebate per month.\nThings you need to know about credit cards for foreign transactions\nLocation Limits\nVisa/ Mastercard are accepted worldwide while UnionPay is widely accepted in Asia but not in the US or Europe. It is best to check with your card issuer before travelling to make sure that your card is accepted.\nUnionPay may not be the best option\nAlthough most UnionPay credit cards offer handling fee waiver while Visa/ Mastercard charges 1.95% handling fee, it is not necessarily the most money-saving. Cardholders need to take exchange rates and rebate/mile conversion rates into account.\nTravel/ Overseas Spending Credit Cards Frequently Asked Questions\nAre there any charges using UnionPay credit cards overseas?\nMost of the Union Pay credit cards offer overseas charges waiver except for those issued by Hang Seng and HSBC.\nWhat currency should I use in foreign transactions?\nWhen using a credit card overseas, it's generally recommended to choose the local currency to avoid high conversion rates and additional fees associated with Dynamic Currency Conversion (DCC) (usually 4% or more in Hong Kong) . Paying in the local currency typically results in a better exchange rate provided by your credit card company. Additionally, opt for travel-oriented credit cards that waive foreign purchase fees or offer no foreign transaction fees to save money on international transactions.\nDo cardholders get the exchange rate on the day of spending?\nNo. It will only become visible when the transaction is actually posted, which usually takes a few days.\nWhat do cardholders need to pay attention to on overseas spending?\nIt is important to bear in mind transaction fees should not be the sole factor when deciding which card to use for foreign transaction. You should also consider other factors such as exchange rate and card rebate, etc.\nHomeCredit CardsOverseas Spending\nAbout Careers Contact Us\nDisclaimer: At MoneySmart, MoneySmart HK Limited will do a variety of product listing services including but not limited to credit cards, personal loans, home loans and all products from virtual insurance companies.\nFollow us\n© 2009-2024 MoneySmart. All rights reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy.", "content_type": "text", "score": null, "meta": {"url": "https://www.moneysmart.hk/en/credit-cards/travel-overseas-spending", "content_updated": true}, "id_hash_keys": ["content"], "embedding": null, "id": "df2b6557f33aafe3ee1ca1f8663e83b4"}