{"content": "\n\n\n\n\nPrivacy Policy\nMoneyHero Privacy Policy\nPrivacy Policy\nDate of Last Revision: 14th August 2023\nMoneyHero Global Limited (“MHGL”) and MoneyHero Insurance Brokers Limited (“MHIBL” and together \"we\", “us” or “our”) are part of MoneyHero Group, a group of companies that provide price comparison services as well as financial services, insurance products, communications and other products and services across Asia.\nThe MoneyHero.com.hk website (\"Website\"), including the content, features, tools, data, software and functions made available by us through the Website, our mobile applications, including the MoneyHero mobile software application (“Mobile App”) and any other websites or applications we operate (unless those websites or applications have posted separate or additional terms of service) (together, the “Services”) are owned by MoneyHero have been created to provide information to our visitors (“you” and “your”) about our products and services. For the avoidance of doubt, other than the provision of marketing services to virtual insurance companies that do not work with insurance intermediaries, MHGL does not carry on an insurance business and all insurance-related activities referred to on the Services are carried out solely by MHIBL.\nThis Privacy Policy explains what information and what Personal Data we collect, why we collect it, how we use and disclose it and how we protect Personal Data in compliance with the Personal Data (Privacy) Ordinance. Please be sure to read this entire Privacy Policy before using our Services. When you use, access or interact with our Services, you are agreeing to our Terms and Conditions and consenting to the practices described in this Privacy Policy with respect to the collection, use and disclosure of your information.\nIn this Privacy Policy, the term \"Personal Data\" means any data relating directly or indirectly to a living individual which is capable of being used to identify that individual.\nInformation We Collect\nWe collect information about you in three main ways: when you provide it to us, with automatic technologies and when third party sources provide it to us.\nInformation We Collect\nWhile registering for an account and/or using of our Services (for example, in order to get comparative quotes for personal loans), your Personal Data may be collected or provided by you to us in various ways.\nThe following are examples (without limitation) of the circumstances in which we collect Personal Data:\nWhen you subscribe to receive updates from us, we will ask for your email address and/or your mobile number;\nWhen you register an account on our Services, we may ask for your name, email address, telephone number and/or mobile number;\nWhen you register an account on our Services and/or log in through third-party social logins (i.e. Google Sign-in or Facebook Login Feature), we may collect your email address and/or basic profile info (profile picture and full name) and any other data that you would have explicitly consented to our collection;\nWhen you request quotes for certain products, we may ask for information like your age and income, so that we can obtain accurate quotes;\nWhen you redeem a reward on our Services, we may ask for your name, email address, the product you applied for, your application reference number and/or your application date;\nWhen you reach out to us for support, give us feedback, participate in optional surveys, subscribe to marketing, attend our events, participate in product research or training or otherwise interact or communicate with us, we may ask for your name, email address and/or phone number and any other personal information you choose to share\nWhen you apply for a product or a service using the application forms on our Services, we will collect information which includes but is not limited to contact details, identification information and financial information;\nIf you want to add a child or family member to your application for a product or service, we may collect that family member’s name and date of birth, so that we can process the application; and\nWhen you request your credit profile, we may ask for your personal information such as your name, mobile number, identity card information including the identity card number and other particulars stated thereon together with the identity card image, selfie images and/or facial recognition data for identity verification and eKYC purposes.\nThe Personal Data we may ask you to provide includes (without limitation):\nname\naddress\nemail address\ntelephone number\ndate of birth\nage\ngender\nnationality\nany messages if you write to us using the \"contact us\" form\nyour saving goals\nyour residency status\nyour income\ndetails of the products you are looking for (for example, the size of loan)\npassport number, HK ID or other identity copies and details (where required for purchasing a product and/or providing your credit report or score)\neducation history\nassets\nemployment status\nemployer or company details\ndetails of beneficiaries, such as joint policy holders and minor beneficiaries (where required for purchasing a product)\nfamily members (where required for purchasing a product or availing of a service)\ndetails of your property (when purchasing home insurance)\ndetails of your travel (when purchasing travel insurance)\nfinancial details about you, including details related to the payment method(s) such as credit card and bank account information (when purchasing a product) and\ninformation related to any of the above.\nMost often, the provision of the above data is on a voluntary basis. However, if you do not provide sufficient information to us, third party products and service providers may not be able to provide the requested information, products or services to you.\nAutomatic Collection of Computer Data\nIn addition, when you use the Services, we may automatically collect certain data about how you access and interact with our Services which may, when combined with other information about you, constitute Personal Data. Automated technologies, such as our use of ‘cookies’, web beacons and similar technologies help us achieve our goal of providing you with the best possible service. When you access our Services, our servers will record, or track information sent from the browsers. This can include the following information (without limitation):\nattributes of the equipment or device you are using, such as the operating system, hardware version, device settings, software and device identifiers;\ndevice locations, including specific geographic locations identified through GPS signals or other means;\nconnection information such as the name of your mobile operator, ISP or other service provider, browser type and IP address;\nthe website from which you have reached the Services;\nthe Website pages viewed;\ndetails of the products and services on the Services that you look at, information, tools and content available on our Services that you use;\ntime spent on the Services;\nlinks from our Services that you click on;\nquotes you request from our Services;\nyour transactions on our Services and details of any payments made by you (including bank account and credit card details and any other account identification information); and\ninformation related to any of the above.\nOur use of cookies enables us to:\nprovide you with a more personalized experience on our Services. It allows us to remember you when you revisit our Services. You can also access your previously saved quotes;\nstudy browsing habits on the Services. The more we understand what products you are interested in, the greater our ability to offer you customized solutions and targeted advertisements and other marketing materials; and\nobtain information regarding the number of visitors to the Services and the pages viewed.\n  In most cases, cookies are deleted when you close your browser; these are referred to as session cookies. However, persistent cookies stay on your browsing device either until such time as you delete them, or they expire. By using the Services, you consent to us using cookies. Such use of data does not disclose any of your Personal Data, and we will not collect, process or use any of your Personal Data in this regard.\nYou can alter your computer browser settings to block or delete cookies. If you opt to block or delete cookies of the Services, you may not be able to access certain products or services and this could have an effect on the performance of the Services on your system (for example, banner ads may not display properly). If you have registered an account with us, you may be required to re-enter your password more frequently during your use of our Services if you choose to disable cookies.\nIn some cases, we also use cookies or similar technologies provided by trusted third parties. The Services use a feature of Google Analytics, a widely consumed analytics solution. This setup allows for a more accurate tracking of our users by associating that user with the same ID over various sessions and devices. This approach may combine analytics data with other Personal Data about you that we have collected by our Services. Any such combined data will be treated as Personal Data by us and used in accordance with this Privacy Policy. By registering an account with us and using the Services, you consent to us using session unification in this way.\nWe may use features in Google Analytics and Google Display Network, including advertising and remarketing, that allow us to target ads to you and report on demographics and interests. These tools use cookies and other information to show ads based on your past actions on our Services. If you would like to opt out of these features please visit https://www.google.com/settings/ads/.\nWe use Hotjar in order to better understand our users’ needs and to optimize this service and experience. Hotjar is a technology service that helps us better understand our users experience (e.g. how much time they spend on which pages, which links they choose to click, what users do and don’t like, etc.) and this enables us to build and maintain our service with user feedback. Hotjar uses cookies and other technologies to collect data on our users’ behavior and their devices (in particular device's IP address (captured and stored only in anonymized form), device screen size, device type (unique device identifiers), browser information, geographic location (country only), preferred language used to display our website). Hotjar stores this information in a pseudonymized user profile. Neither Hotjar nor we will ever use this information to identify individual users or to match it with further data on an individual user.\nFor further details, please see Hotjar’s privacy policy by clicking on this link\nIf you do not want to be recorded by Hotjar, you can disable it by setting the DoNotTrack header in your browser. For more information and more about Hotjar's data processing, please visit: www.hotjar.com/legal/compliance/opt-out.\nInformation Provided to us by Third-Party Sources\nFinally, when you use the Services, we may also receive information about you from other third parties we have engaged such as business associates, subcontractors, analytics providers, platform providers and search information providers or, pursuant to your request, from third party providers of our Partners. We protect and process information obtained from those parties as described in this Privacy Policy, consistent with any additional restrictions imposed by the source of the information. Our sources may vary over time and depend upon how you use the Services. For example, we receive information from:\nCredit bureaus and other third parties. Many of our features rely on information about you that we receive from third parties. For example, with your explicit consent, we offer you free credit profiling services based on information obtained from credit bureau partners (like TransUnion). Our partners\nmay also provide information such as employment or income data, vehicle or driver information, or information about special offers available based on your credit profile so that we can give you more personalized recommendations.\nWe remind you that some experiences and/or features of the Services we provide require you to provide information for it to function. If you do not wish to provide the required information, you may not be able to use certain features.\nInformation from Integrated Services like Facebook or Google\nIf you decide to register an account with us or log in through or otherwise grant access to a third-party social networking site such as Facebook or Google (“Integrated Services”), we may also collect Personal Data that is already associated with your Integrated Service account. These Integrated Services will authenticate your identity and provide you the option of sharing additional information with us. Should you choose to register or log in to our Services with your Integrated Services account, you are explicitly giving us permission to use, share and store the credentials you provide, your name, email address(es), date of birth, gender, current city, profile picture URL and other information that the Integrated Service makes available to us, in a manner consistent with this Privacy Policy. You should check your Facebook or other Integrated Services privacy settings to understand and change the information sent to us through Facebook Connect or other Integrated Services. Please review each Integrated Service's terms of use and privacy policies carefully before using their services and connecting to our Services in this way.\nAccuracy and Retention of Personal Data\nBy providing us with your Personal Data or that of a family member, you warrant that such data is true and accurate, and undertake to notify us as soon as practicable of any change or alteration to the same. Any loss or damage caused to the Services or to the person responsible for the Services or to any third person through the provision of erroneous, inexact or incomplete information will be your exclusive and absolute responsibility. When you give us Personal Data about another person (or persons) such as a family member, you should have the authority to act on such person’s behalf (whether by appointment or by law in your capacity as legal guardian). This includes providing consent to our processing of their Personal Data. If for any reason you are concerned as to whether you are permitted to provide us with another person’s information, please contact us at the email address listed below before sending us anything.\n We may retain customer and/or user Personal Data for as long as your account with us is active and not deleted; as reasonably necessary for us to provide or offer our services to you and/or your organization; as long as we consider necessary for to fulfil the purposes we collected it for  (further detailed in the \"What do we use your Information for?\" section below), including for the purposes of satisfying any legal, regulatory, tax, accounting or reporting requirements. We may retain your Personal Data for a longer period in the event of a complaint or if we reasonably believe there is a prospect of litigation in respect to our relationship with you.\n  You have the right to request access to and correction of your Personal Data as held by us. Please contact us at support@moneyhero.com.hk at any time if you wish to correct, amend or update your\nPersonal Data. We aim to acknowledge and act upon your request promptly. To help us respond in the most timely and appropriate way, please be as specific as possible in your request or inquiry. For credit profiling services, where the request relates to credit bureau information, we may need to direct your request to the relevant credit bureau to provide you with further assistance.\nWhat do we use your Information for?\nWe use the information we collect about you for our legitimate business interests to operate the Services, to enhance and customize users’ experiences with the Services and to improve and grow our business. Depending on the nature of your relationship with us, we may use your Personal Data for some or all of the following purposes:\nto set up and administer your account with MoneyHero.com.hk and/or the Mobile App;\nto protect the security of your account by sending a verification code to your phone when you log in from a new device;\nto provide support, answer your queries and to communicate with you, for example, providing you with alerts, notifications and recommendations;\nto allow you to access and use our free comparison services and to provide quotes to you;\nto enable you to access online application forms on third party external sites;\nto process applications for Partner Products on your behalf (see below section \"Partner Products\" for further information);\nto analyze customer behavior, market trends and client demographics so that we can improve our services and to enable us to provide a more personalized service and more relevant communications to you;\nwhere you have registered an account with us, to enable us to save your Personal Data so that you do not have to re-enter it each time you request a quote or apply for a product;\nto enable us to store data and manage our business operations efficiently;\nwhere you have signed up to receive electronic communications from us, to send you marketing and/or promotional materials on our latest products and services or those of carefully selected third parties;\nwith your consent, for remarketing and personalization purposes (as further described below)\nwhere you have registered an account with us, to send you service-related messages including, without limitation, a welcome/confirmation email when you register your account and to enforce our Terms and Conditions and other policies. You may not opt-out of receiving service-related messages from us, unless you deactivate your account;\nwhere you have registered an account with us, to send you personalized special reports, exclusive member offers and latest feature announcements in relation to your account. You may not opt-out of receiving membership-related messages from us, unless you deactivate your account;\nto diagnose and prevent service, security or technical issues affecting the Services;\nto monitor, detect and prevent fraud or abuse of the Services;\nto protect the safety, integrity and/or rights of our users or any third party;\nto verify your identity through manual and/or e-KYC checks and/or to identify you to a Partner (for example, a credit bureau partner) that you wish to receive goods or services from;\nto provide features to you, such as displaying your credit profile information on the Mobile App;\nto personalise your experience and tailor recommendations, advertising and offers presented to you, including through the development of insights about you and your needs based on profile matching and your interactions with the products, services and offerings of our Services\nto comply with our legal and regulatory obligations;\nto enable us to provide services and products related to the above and/or otherwise related to your use of the Services; and\nany other directly related purpose(s).\n\nTo provide you with valuable personalised suggestions and experiences, we may process your personal information using automated and/or manual (human) methods. Our automated methods may include artificial intelligence (AI) and a range of technologies that help our services learn and reason to improve our ability to personalize and enhance your experience when using the Services\nIn some circumstances we will anonymize your Personal Data (so that it can no longer be associated with you) for research or statistical purposes, in which case we may use this information indefinitely without further notice to you.\nWe may participate with our marketing partners for the purposes of delivering personalized advertisements to you based on the usage data and/or Personal Data that we have collected from you, including your email address.  \n  For example, we use Criteo, Facebook Custom Audience and Google Customer Match to display personalized ads to persons on our email and/or phone number lists when they visit Facebook or Google sites.  We may also share your personal data with Google and Facebook for the purposes of creating target groups.  For more information about the privacy practices of Criteo, please visit https://www.criteo.com/criteo-privacy-guidelines-for-clients-and-publisher-partners/. For more information about the privacy practices of Facebook Custom Audience, please visit https://en-gb.facebook.com/legal/terms/customaudience.  For more information about Google Customer Match, please visit https://support.google.com/google-ads/answer/6334160?hl=en&ref_topic=6296507.  \n  From time to time, we may participate in additional retargeting and behavioral advertising services that will be similar to the services described above.  Users of the Services are, by submitting their information to us, consenting to our use of these remarketing services and the related processing of their Personal Data.  To opt-out of participation, you may send an email, from the email address you are opting out of, to the email address provided in our contact information below.  In addition, depending on how you access the Services (by computer or mobile device), you can control the placement of cookies and other data collection methodologies for purposes of opting out; however, as mentioned above opting out may have an impact on your ability to avail of our services.\nPartner Products\nWe save you time by allowing you to apply on our Services for products and services provided by third parties (\"Partner Products\"). If you apply for a Partner Product via our Services, your Personal Data will be transferred to the provider and your application will be processed by that provider. That provider may contact you directly about your application. Your Personal Data will be used, processed and stored in accordance with that provider's privacy policy, which is outside MoneyHero's control.\nHow do we Disclose your Information?\nWe are committed to keeping your Personal Data and other information shared with us confidential. There are, however, certain circumstances in which we may disclose or transfer your Personal Data to certain third parties without further notice to you, as set forth below:\nRelated Companies: We may share your Personal Data with our affiliates in  MoneyHero Group (subsidiaries/affiliated companies of CompareAsia Group Limited) that provide services to or share services with us.\nBusiness Transfers: As we develop our business, we might sell or buy businesses or assets. In the event of, or in preparation for, a change of control, merger, acquisition, restructuring, dissolution or similar event, we may disclose or transfer Personal Data to a third party.\nPartners: We may be required to share information with our partners who are banks, brokers, lenders, insurance companies, credit bureaus and other money and financial service providers whose products may be displayed on our Services from time to time (\"Partners\") or when you have requested the products and/or services of our Partners, which requires us to provide your Personal Data to them in a pre-populated form or by API. In order for you to redeem a reward on our Services, we may also need to share those details with the relevant Partner in order to authenticate your reward redemption.\nPublic Forums: We may provide opportunities for you to publicly post reviews, questions, comments, suggestions or other content, which may include personal information, such as your name or user name. Anything you share in a public forum is public, and you should think carefully before you decide to share.\nAgents, Consultants and Other Service Providers: We rely on service providers to help support our business and the Services, for example (without limitation) our third-party payment service providers, IT and analytics service providers, back office support, business consultants, legal service providers and marketing service providers. When we engage another entity to perform a function of this nature, we only provide them with the information that they need to perform their specific function.\nMarketing Partners. We may share your Personal Data with our marketing partners including third party service providers, advertisers, advertising networks and platforms, advertising agencies, and data aggregators to serve and offer personalized ads. We may share Personal Data with our marketing partners to correlate and match our list with our marketing partners' lists for purposes of creating an \"audience\" for serving personalized ads.\nLegal Requirements: We and/or any of the third parties listed above may also be required to disclose your Personal Data to any court, law enforcement body, government department, regulator or industry body of any country where required by the laws of Hong Kong or any other jurisdiction, or in response to a lawful request in Hong Kong or elsewhere. We may also need to disclose your Personal Data (i) to identify, contact or bring legal action against any person who may be causing damage to or interfere with our and/or any third party's rights or property (whether intentionally or otherwise) and/or (ii) to help with anti-money laundering and counter-terrorist financing requirements of our Partners or other third parties.\n  We use Stripe for payment, analytics, and other business services. Stripe collects identifying information about the devices that connect to its services. Stripe uses this information to operate and improve the services it provides to us, including for fraud detection. You can learn more about Stripe and read its privacy policy at https://stripe.com/privacy.\nFor credit profiling services, when you request your credit profile through the Services, we may transfer your Personal Data to TransUnion Credit Information Services Limited, a credit referencing agency (\"TransUnion\"), where your Personal Data will be processed for the purposes of verifying your identity through eKYC checks in order to access your credit data in TransUnion’s database , based on your explicit consent. Your Personal Data transferred to TransUnion for this purpose will be used, processed and stored in accordance with the TransUnion’s privacy policy, which is outside of our control. For more information on TransUnion’s privacy policy, or enquiry and/or request for correction on your credit profile, please visit https://www.transunion.hk.\n  The companies within the MoneyHero Group currently operate in Singapore, Hong Kong, Taiwan, the Philippines and Malaysia.  MoneyHero Group typically works with vendors and partners who operate predominantly in South East Asia but from time to time, we may work with vendors and partners in other parts of the world such as the United States.  In connection with the purposes set out in this Privacy Policy, your Personal Data may be transferred outside Hong Kong. That means your Personal Data may not be protected to the same or similar level as it would in Hong Kong. However, we will take all reasonable measures to ensure that your data is processed and stored securely, regardless of the country in which it is processed or stored. By using our Services and/or submitting any Personal Data to us, you acknowledge and agree that your Personal Data may be processed in and transferred to jurisdiction(s) other than your country of residence which may have different data protection laws that those in your country (and, in some cases, may not be as protective).\nBy using our Services, you consent to the use and disclosure of your Personal Data as set out above.\nKeeping you Updated Regarding our Services & Direct Marketing\nAfter you use our services, and provided you have subscribed to receive our communications, we may use your Personal Data (including your name, address, email address and telephone number) to contact you about news, offers, events, and promotional campaigns in relation to price comparison services and/or financial services, insurance, communications, online content and other products and services that we feature on the Services from time to time.\nFor example, this may include credit cards, mortgages, personal loans, insurance products, broadband services etc. We may use other data collected about you, including but not limited to your age, location, income bracket, employment, browsing history, purchases and quotes requested in order to provide materials that are customized and relevant to you. You may opt-out of receiving our newsletter and other direct marketing communications at any time by clicking on the unsubscribe link contained in our email to you.\n  These communications are separate to those you will receive as a result of registering an account with us. In addition to account-related communications, our logged in users will receive exclusive and/or advance access to personalized content available and distributed only to them, which may be sent by email. As a logged in user you may not opt-out of receiving membership-related messages from us, unless you deactivate your account.\nWith your explicit consent, we may also provide your Personal Data (including your name, address, email address and telephone number) to our Partners so that they may contact you with news, offers, events, and promotional campaigns in relation to price comparison services and/or financial services, insurance, communications, online content and other products and services that we feature on the Services from time to time.\nWe may also share aggregated data, provided your identity will not be disclosed by such sharing, with third parties for various purposes (including marketing and advertising), and may use this data in order to better understand your needs and to improve and adapt our products and services, but please note that, unless permitted or required by law or as otherwise set out in this Privacy Policy, we will not disclose your Personal Data to any third parties without your prior consent.\nIf you have any questions or concerns about the communications you are receiving from us, you  can get in touch with us at any time, free of charge (see \"Your Rights\" below).\nThird-Party Providers\nIf you opt to enter into a contract with a third party through our Services, the data you provide to the third party will be transferred to that third party and controlled by the third party in accordance with that third-party provider's privacy policy. Therefore, you should contact them directly for additional information in relation to their privacy policies and read all policies, terms and conditions before entering a contract. We are not responsible for how third-party providers use your Personal Data.\nData Security\nWe are fully committed to safeguarding the privacy of our customers, online and otherwise, and the success of our business depends on our ability to maintain the trust of our clients and customers. We apply Defense in Depth approach in securing Personal Data entrusted to us by our customers and continuously improve those measures to address security risks. We use Amazon Web Services, Inc (“AWS”) as our technology infrastructure service provider to power the main core of our Services. Data we collect is stored in data centers operated by AWS which offer best-in-class security. For more information, please visit: https://aws.amazon.com/security/.\nWhen you register for an account with us, you will be asked to choose a password. It is your responsibility to keep your password safe, and not share it with anyone. We are not responsible for any transactions conducted by a third party that has logged in to your account using your password. If you suspect that your account has been used by someone other than you, please notify us straight away.\nDespite our security precautions, we cannot fully guarantee the security of your Personal Data because of the inherent risks of data transmission over the internet. At all times, you assume the risks associated with the transmission of your Personal Data over the internet and the possibility of malware present on your device used for our Services. Therefore, you should ensure that you only enter or upload your Personal Data on a secure device within a secure environment.\nConsent\nThis Privacy Policy supplements but does not supersede nor replace any other consents you may have previously provided to us in respect of your Personal Data, and your consents herein are additional to any rights which we may have at law to collect, use or disclose your Personal Data.\nUse of the Services by Minors\nThe Services are not directed to individuals under the age of eighteen (18), and we request that these individuals do not access or use our Services.\nImproving our Service.\nIn order to ensure that the services we offer you continue to meet your requirements; we might ask for your feedback. Any feedback or other information you submit to us will, unless otherwise stated, be used in accordance with this Privacy Policy and our Terms and Conditions.\nYour Rights\nYou have the right to check whether we hold Personal Data about you and to require access or correction of your Personal Data. You can also unsubscribe from receiving our newsletter and other promotional communications from us at any time by clicking on the unsubscribe link in our email to you. You are also entitled to opt out of receiving direct marketing or promotional communications from us, our affiliates and any of our Partners.\nIf you wish to exercise any of your above-mentioned rights, or you have any inquiries or complaints in respect of your Personal Data, please kindly address your enquiries to:\nPersonal Data Protection\nsupport@moneyhero.com.hk\n  22/F, East Exchange Tower, 38 Leighton Road, Causeway Bay\nDeleting Your Account\nIf you wish to delete your account or request that we no longer use your information to provide you with our services, please visit the ‘Settings’ section of the Services to delete your account. If you register or log in to your account through Integrated Services, you can also choose to disable the connection between the Services and the Integrated Services at any time. When deleting your account information (including any identifiable information regarding your family member that you have provided or has been collected), we may retain general demographical information about you such as your general transaction history and will remove any personally identifiable information associated with this data so that it can no longer be associated with you for research or statistical purposes.\nChanges to this Privacy Policy\nWe may need to revise or update this Privacy Policy from time to time in order to reflect changes in our Services, our business or applicable law. We reserve the right to modify this Privacy Policy periodically without prior notice. Your continued access or use of the Services after any changes or revisions to this Privacy Policy will be deemed to constitute your agreement with the terms of such revised Privacy Policy. We will always include a ‘last revised’ date as part of our privacy policy. You may check this page periodically to stay informed of our Privacy Policy.\n  This Privacy Policy has been prepared in both English and Chinese. In the event of discrepancies between the English and Chinese version, the English version shall apply and prevail.\nContact Us\nMon-Fri 9:30am - 6:00pm\nTel: 3018 9760\nIf you'd like to talk to someone right away, simply give us a call - we're here for you!\n22/F, East Exchange Tower, 38 Leighton Road, Causeway Bay  \nHong Kong's #1 personal finance comparison site\nMoneyHero is your go-to resource to find the right financial products. Use our powerful product selection tools and comprehensive analyses to make more rewarding choices.\nSecure & Reliable\nImpartial & Independent\nPersonalised\nKEEP IN TOUCH\nFACEBOOK\nYOUTUBE\nINSTAGRAM\nWhy MoneyHero?\nWe analyse, compare, and review 350+ financial products from 60+ financial institutions to help you find the one that best suits your unique needs to save more and earn extra.\nWe adopt robust data security and privacy measures for the thousands of applications made every month.\nOver 2 million Hongkongers visit our site monthly for answers to their financial questions and discover new ways to earn, save, spend, and invest.\nDon't just take our word for it\nMoneyHero is a way of life whenever I make any financial decision. With MoneyHero, I can now make informed decisions from travel insurance to credit cards because MoneyHero does exceptional comparisons and illustrations from a consumer point of view. I now know I will not be shortchanged as long as I check out MoneyHero beforehand.\nHow Our Comparison Platform Works\nWe simplify the task of finding the right financial product. We develop insightful articles to equip you with the knowledge you need to achieve your financial goals. We also ensure your data is safe and secure. Here are a few extra reasons why MoneyHero is your trusted digital personal finance platform.\nWe are a free, impartial platform that reviews and compares financial products from 60+ financial institutions, securing offers not available on other sites.\nYour interest comes first! We make sure the terms and conditions are transparent and easy to understand.\nOur trained support team is a phone call or an email away, ready to provide attentive service.\nAlways More at MoneyHero\n  Don't want to miss our updates?\nSubscribe now and get the latest tips on how to save and spend wisely!\nor\nLike our Facebook page\nCredit Cards\nPersonal Loans\nCar Insurance\nTravel Insurance\nMedical Insurance\nHome Insurance\nDomestic Helper Insurance\nMortgages\nFinancial Tools\nSecurities Accounts\nGuides\nAbout Us\nDisclaimer: MoneyHero makes every effort to keep information on our website accurate and up-to-date. This information may be different from what you see when you visit a financial institution or service provider’s site. APR and monthly payments shown in personal instalment loan comparison pages are estimated based on calculation of information you enter. All financial products and services are presented without warranty. When evaluating offers, please review the financial institution’s Terms and Conditions. If you find discrepancies in information, please contact the financial institution directly.\n  © 2013 - 2024 MoneyHero Global Limited (registered in Hong Kong under company number 1864714) (“MHGL”). All rights reserved. MoneyHero Insurance Brokers Limited (registered in Hong Kong under company number 2196683) (“MHIBL”) is a wholly owned subsidiary of MHGL. MHIBL is an authorized insurance broker with Insurance Authority License Number FB1740 whose business it is to arrange insurance products and services for its clients. MHGL is not an insurance company, agent or broker. Other than the provision of marketing services to virtual insurance companies that do not work with insurance intermediaries, MHGL does not carry on an insurance business and all insurance-related activities displayed, offered or referred to on this site are carried out solely by MHIBL in its capacity as an insurance broker. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy. ", "content_type": "text", "score": null, "meta": {"url": "https://www.moneyhero.com.hk/en/page/moneyhero-privacy-policy", "content_updated": true}, "id_hash_keys": ["content"], "embedding": null, "id": "475a133c9943a6b332645b8452c5ce22"}