{"content": "Best Mortgage Loan Rates & Cash Rebate\nFind the best mortgage plan with a desired mortgage rate and cash rebates for your new property purchase in Hong Kong! Our mortgage specialists will guide you all the way through and get you the best deal.Apply for mortgage loans through MoneySmart today!\nNew Buy\nRefinance\nHow do I start?\nTypes of Mortgage\nHow do I Choose?\nHow do I Apply?\nTools & Calculators\nFAQ\nWe Work With Many Providers\nNew Customers Referral Reward Scheme\nWhat is Mortgage Loan?\nA mortgage is a loan that mortgage borrowers take out for house buying. If the repayments slip through, the lender can repossess the property and sell it. To avoid this from happening, it is important for mortgage borrowers to compare different mortgage offers and pick the one that is affordable. \n\nHIBOR Rate (known as H Plan) is the benchmark interest rate for lending between banks within the Hong Kong market while Prime Rate (known as P Plan) is decided by individual banks. H Plan is reflective of the borrowing costs, so it fluctuates on a daily basis. A few years ago, HIBOR was low, so many applicants preferred H Plan over P Plan. However, HIBOR has increased a lot in recent years and many mortgage borrowers end up using the capped mortgage rate to repay their monthly mortgage. Given this situation, the interest rate of H Plan and P Plan are much closer now. \n\nIf you are like most people, you are very likely to be time deprived to conduct all the research on mortgage yourself. That’s where MoneySmart comes in. We provide free valuation and application service. You can apply for an array of plans and the application results will be available in just 9 working days. What's more, you can get up to a 1% rebate!\n\nCompare Mortgage Loan Interest Rates\nCitibank\nP(5.25%) - 2.75% = 2.5% H+1.3% 1.2%\nStandard Chartered\nP(5.25%) - 2.75% = 2.5% H+1.3% 1%\nHSBC\nP(5%) - 2.5% = 2.5% H+1.3% 1%\nBank of China\nP(5%) - 2.5% = 2.5% H+1.3% 1%\nHang Seng Bank\nP(5%) - 2.5% = 2.5% H+1.3% 1%\nClick Here for More Mortgage Plans\nGet a personalised Mortgage Plan now!\nGet Quotes\nMortgage for different types of properties\nHOS Mortgage\nHOS mortgage borrowers can borrow up to 95% of the property value with a maximum mortgage term up to 25 years.\nSecond-hand Property Mortgage\nBanks are usually more conservative towards second-hand property than new build property. The 2019 Policy Address has relaxed the mortgage policy in Hong Kong, allowing first-time buyers to take out loans with 90% loan-to-value ratio for properties worth as much as HK$8,000,000, which makes second-hand property more popular.\nVillage House Mortgage\nVillage houses are more complex for loan application as it usually takes a bank longer to investigate the title, permitted uses, legality of construction, encumbrances and easements. Moreover, transaction volumes of village houses are thinner, resulting in down-valuation. The maximum LTV ratio is usually 50%-60%. First-time buyers may be able to obtain further financing through Mortgage Insurance Programme (MIP). If the applicant qualifies financially, some banks are willing to offer up to 85% LTV ratio.Moreover, mortgage borrowers can choose H Plan or P Plan.\nUncompleted Buildings Mortgage\nOnly stage payment plan (i.e. repayment only begins when the buildings are completed) is applicable for 90% LTV ratio while the cash payment plan (i.e. repayment begins before the buildings are completed) is not applicable for 90% LTV ratio. Property developers usually provide attractive offers to buyers who start the cash payment plan but it comes with risks as the buildings are not completed.\nTong Lau Mortgage\nThe property price of tong lau (old building) is usually a lot cheaper. It is worth around HK$2,000,000. First-time buyers can obtain further financing through the Mortgage Insurance Programme (MIP) though mortgage borrowers could usually only get up to 60% LTV ratio as it may involve illegal structure or subdivided units. Moreover, the age of these buildings is usually quite old, ending up with a short mortgage term.\nPublic Housing Mortgage\nPublic housing owners can apply for a mortgage of 95% or even 100% LTV ratio and the maximum repayment period is 25 years. Moreover, mortgage borrowers are exempt from the stress test, and the interest is the same as that of a private property. You can repay by H or P. If the public housing unit is resold within five years, it is subject to more restrictions. If it is beyond 5 years, the owner can sell the unit in the open market.\nCommercial Buildings Mortgage\nSince it is not residential buildings, banks tend to be more conservative in their valuations of these buildings, and according to current regulations, all non-residential units can only get up to 40% LTV ratio. The current additional stamp duty (SSD) and buyer stamp duty (BSD) applicable to residential buildings are not applicable to industrial buildings. In terms of tenure, the maximum period of mortgage for industrial buildings is 20 years. However, if the applicant is too old or the age of the building is too old, it will not be possible to obtain 20 years of mortgage term.\nCar Park Mortgage\nCar parking mortgages are different from residential property mortgages in terms of LTV ratio, interest rate and repayment period. If you do not have other mortgage properties at the time of application, the LTV ratio is 50% with a maximum repayment period of 15 years.\nForeclosure Mortgage\nOccasionally, there are foreclosure buildings for sale in the market. If it was only because the original owner was unable to repay the mortgage due to debt problems, then it shouldn’t be difficult to obtain a mortgage. However, if it involves unauthorized construction, loss of property deeds, unclear title, etc., the mortgage will be affected. Therefore, it is important to conduct thorough research before purchasing.\nContact a MoneySmart Mortgage Specialist\nContact Now\nMortgage for different types of applicants\nFirst-time home buyers\nFirst-time home buyers (i.e. homebuyers who are not currently owning another property) are able to borrow up to 90 % of a property's value to a maximum of HK$8 million, from HK$4 million previously with mortgage insurance. That means first-time home buyers can buy more expensive homes with a down payment of just 10%\nNon first-time home buyers\nNon first-time homebuyers are required to pass the stress test and the maximum LTV is 80%. Stress test is calculated at the current interest rate plus 3%. To pass the test, it requires the applicant’s DSR to be less than 60%.\nHomebuyers looking to switch homes\nIf you are switching homes and wonder if you still enjoy first-time buyer status, it will depend on whether the credit history of your old property is still in your TransUnion report at the time of signing the formal agreement for sale and purchase.\nCivil Servants\nCivil servants enjoy non-accountable cash allowance schemes to subsidise their mortgage for up to 10 years, according to terms of appointment, length of service, salary, etc. This subsidy can be taken into account together with your monthly income when taking the stress test.\nSelf-employed/ Applicants with No Fixed Income\nSelf-employed applicants with no fixed-income usually need to go through a more stringent application process e.g. providing income proof for a longer period of time and undergoing a stricter stress test to prove an individual’s ability to repay. It is less likely that 90% LTV will be approved for these applicants.\nMortgage Rates, Stamp Duty and Lawyer Fees\nMortgage Rates\nThere are mainly two types of mortgage rates, namely HIBOR Rate and Prime-based Rate in Hong Kong.\nHIBOR Rate (known as H Plan) is the benchmark interest rate for lending among banks while Prime-based rate (known as P Plan) is decided by individual banks. H Plan comes with a cap limit to ensure you rate protection in case of fluctuations. For example, if H is H+1.1% with HIBOR as 0.5 and P-2.5% as cap limit, the interest rate ranges from 1.6% to 2.5%. From historical record, H Plan usually offers better interest rates. Even if it goes up, it comes down quickly and it almost never hits the rate of P Plan.\nStamp Duty\nStamp duty refers to the tax payable to the government for selling or buying properties.\nThere are 3 main types of stamp duties:\nAd Valorem Stamp Duty (AVD) for Residential Property\nNon-Residential Property Special Stamp Duty (SSD)\nBuyer’s Stamp Duty (BSD).\n\nHong Kong permanent residents who are first-time buyers are exempted from most of the stamp duties. Both Hong Kong permanent residents who are purchasing their first homes or switching homes are required to pay AVD at the time of purchase. If you are first-time buyers, the rate is 3%. If not, it is 15%. Moreover, special Stamp Duty (SSD) applies to any properties resold within 36 months or less to curb house flipping and BSD is an additional upfront tax on non-permanent-resident buyers.\nLawyer Fee\nBuying a property involves a lot of legal procedure and documents, including confirming the title, signing of formal agreement for sale and purchase, deed execution, etc. It usually costs a few thousands. If it is more complicated involved, the fee will go up. It is wise to agree the fee with your lawyer first before you commission them to deal with the conveyance.\nHow do I choose a Mortgage Plan?\nHow to calculate Loan-to-Value (LTV) Ratio?\nLTV ratio is calculated based on dividing the loan amount by the appraised value of the property. For example, if a mortgage borrower has taken out a loan of HK$5,000,000 for a property that worth HK$8,000,000. The LTV ratio is 62.5%. LTV ratio is affected by a number of factors. MoneySmart has put together 6 factors that affect LTV ratio for your quick reference:\nApplicant’s age\nThe maximum mortgage term is usually calculated by ‘75-applicant’s age’. For example, if an applicant is 50 years old, the maximum mortgage term is 25 (75-50). However, some banks may offer ‘80-applicant’s age’ or even ‘85-applicant’s age’ with a higher interest rate.\nAge of the property\nThe maximum mortgage term is usually calculated by ‘75- age of the property’. For example, if the property is 50 years old, the maximum mortgage term is 25 (75-50). However, some banks may offer ‘80- age of the property ’ with a higher interest rate.\nFirst-time buyers\nThe 2019 Policy Address has relaxed the mortgage policy in Hong Kong, allowing first-time buyers to take out loans with 90% loan-to-value ratio for properties worth as much as HK$8,000,000 previously capped at HK$4,000,000 and up to 80% LTV ratio on properties worth up to HK$10,000,000 , previously capped at HK$6,000,000.\nApplicant’s Credit Score\nProperty types will affect the LTV ratio. For example, banks will be more cautious for village houses mortgage applications, meaning a higher interest and shorter mortgage term.\nProperty Types\nProperty types will affect the LTV ratio. For example, banks will be more cautious for village houses mortgage applications, meaning a higher interest and shorter mortgage term.\nFor Self-occupation or Renting\nThe maximum LTV ratio for self-occupation is 90% while it is 50% for renting in Hong Kong.\nHow to apply for loans with a high LTV ratio?\nThe exorbitant housing prices in Hong Kong means that a lot of the prospective buyers with limited down payment are keen to find out how to get a high LTV ratio. MoneySmart has summarised a table outlining the requirements for getting 90% and 80% LTV ratio. \n\nApply for 90% and 80% LTV ratio\nFirst-time Buyers\nFirst-time buyers (i.e. applicants who do not own a property at the time of application) can take out loans with 90% loan-to-value ratio for properties worth as much as HK$8,000,000 previously capped at HK$4,000,000.\nCompleted VS Off-Plan Properties\nHK$6,000,000 or above: completed properties. HK$6,000,000 or below: both completed and off-plan properties.\nFixed-pay VS Self-employed\nApplicants must be on fixed income, instead of commission and the income must be derived locally. Employees on irregular income or self-employed.\nSelf-occupation VS Renting\nSelf-occupation Occupied by relatives: 80%\nRenting: 50% max\nStress Test\nDSR Limit= 50%\nContact MoneySmart Mortgage Specialist to learn more about Mortage in Hong Kong\nContact Now\nTips for mortgage comparison\nCash Rebate\nWhen comparing mortgage plans, it is important to also take into account cash rebates other than interest rates. A mortgage plan with a high cash rebate can also reduce the costs of a mortgage.\nLoan Amount Will be Reduced Directly if Cash Rebate is in Excess of 1%\nCash rebate may not be paid in cash. According to the regulations of HKMA, if the cash rebate is in excess of 1% of the loan amount, it will be deducted from the final loan amount directly.\nHow do I apply for a Mortgage Plan?\nThe Mortgage Application process\nStress Test\n\nHKMC requires prospective homebuyers to pass the stress test in order to secure a mortgage offer. The monthly repayment amount should be within 60% of the homebuyer's monthly income after 3% interest rate is added to the existing one. However, according to the 2019 policy address, passing the stress test is not a prerequisite for first-time buyers to secure a mortgage offer with a mortgage insurance programme. For non first-time buyers, however, passing the stress test is still a prerequisite for getting a mortgage.\nThe Mortgage Insurance Programme ('MIP')\n\nWhat is the Mortgage Insurance Programme ('MIP')? Launched by The Hong Kong Mortgage Corporation Limited ('HKMC'), Mortgage Insurance Programme ('MIP') provides mortgage insurance to banks to offer mortgage loans with higher LTV ratio (80-90%) without taking additional credit risk. The premium can be paid in one go, yearly or in instalment calculated into the mortgage.\nValuation\n\nMajor banks provide free online evaluation to prospective mortgage borrowers so you get an idea of the property price easily. To avoid down valuation, you can get valuation from different banks for comparison or call the valuation department of the bank directly. How to handle a down valuation? You can take your best valuation and negotiate with the bank that you would like to apply. Moreover, some people may choose to apply for a personal loan for the additional down payment that they need to pay due to down valuation.\nWhy apply through MoneySmart?\nThe Best Mortgage Rates and Cash Rebate\nYou can apply for numerous banks in one go through MoneySmart and enjoy a special interest rate offer from 2.5% and up to 1.43% cash rebate.\nQuick Mortgage Approval\nMany are under the impression that it is quicker to apply through banks directy. However, the staff at the branch is only responsible for receiving the application forms instead of processing it. MoneySmart will instead follow up on your application directly and we have a direct contact at the mortgage department of each major bank. You can apply for an array of plans with a consolidated application form and the application results will be available in just 9 working days. MoneySmart will remind you upon successful application and provide you with any advice and support you may need until you have successfully taken out your mortgage.\nNo Hidden Charges\nThere are no hidden charges. MoneySmart is an online financial product aggregator and we do not charge our customers any fees. Instead, we offer a wide range of promotions and offers. MoneySmart gets commissions from the bank that you have successfully applied for through us.\nContact a MoneySmart Mortgage Specialist Today to Apply for Mortgage\nMoneySmart provides free valuation and application services. Mortgage borrowers can apply for an array of plans and the application results will be ready in just 9 working days. What's more, you can get up to a 1.43% rebate!\nApply for Mortgage today!\nGet Quotes Now\nApplying for your Mortgage with MoneySmart\nStep 1\nGet in touch with our mortgage team\nApplicants can contact our professional mortgage team though our website WhatsApp +852 9665 5218\nStep 2\nCompare mortgage plans\nMoneySmart will follow up on your enquiry and provide you with different mortgage plans to choose from\nStep 3\nApply online with required documents\nFill in a consolidated application form with MoneySmart to apply for a mortgage with different banks. 👍🏻\nStep 4\nCheck the application form and sign it\nThe bank that you have applied for will contact you directly 📞to collect the necessary documents. Applicants can get in touch with the mortgage department directly for future inquiries.\nStep 5\nDraw down your mortgage\nWe will remind ⏰ you upon successful application and provide you with suggestions and assistance you may need until you have successfully got the mortgage.\nWe work with many Providers\nHSBC\nHang Seng Bank\nBank of China\nStandard Chartered Bank\nBank of East Asia\nCitibank\nICBC\nBank of Communications\nChiyu Banking Corporation Ltd.\nChina CITIC Bank International\nChong Hing Bank\nCMB Wing Lung Bank\nFubon Bank\nOCBC\nNanyang Commercial Bank\nMoneySmart Mortgage Tools\nMortgage Calculator\nValuation Tool\nMortgage Applications FAQ\nIn general, how long does it take for a mortgage to be approved?\nGenerally speaking, it usually takes 1-2 week(s) to get a mortgage approved. However, if applicants apply for a higher LTV ratio, it will require MIP providing mortgage insurance to banks, which will take an additional 1-2 week(s). Therefore, it usually won’t take more than a month to get your mortgage result.\nWhat are the benefits of applying for a mortgage through MoneySmart?\nMoneySmart Mortgage Specialists help you compare numerous mortgage plans in one go and apply for a number of plans with a consolidated application form. MoneySmart Specialists can contact mortgage departments of each major bank directly, which can accelerate the application process. What’s more, MoneySmart will provide additional cash rebates, which can cut down your mortgage costs.\nHow to apply for a 90% LTV mortgage?\nLTV ratio is dependent on a number of factors , including different types of property and mortgage applicants. For example, first-time buyers could apply for up to 90% LTV ratio for property worth HK$8,000,000. Also, white form buyers of HOS, for example, could apply for 90% LTV mortgage.\nWhat is mortgage insurance?\nIf your property is worth under HK$6,000,000 and its loan-to-value ratio is over 60%, you’ll need to apply to “mortgage insurance companies” for your mortgage insurance.\nWhat is the maximum loan-to-value ratio for a mortgage?\nThe current regulations of the Hong Kong government and HKMA state that the ceiling of a mortgage is based on the value of the property, ranging from 90% to 50%. The value of first-hand property is decided by developers; and the second-hand is decided by valuations. You’ll need to apply for different mortgage plans according to your financial status. You may also need a guarantor to apply for a mortgage.\nDo banks offer additional incentives?\nYes. It usually comes in below forms: • Cash Rebate: Under the regulations of HKMA, if the cash rebate is more than 1% of the loan amount, it will be deducted from the final loan amount • Mortgage Link：It is an account with an interest rate equivalent to the mortgage loan interest rate, allowing mortgage borrowers to offset part of your mortgage interest.\nWill banks check my credit score report upon my mortgage application?\nYes. Banks will usually check your credit record and credit score before approving your mortgage application. To improve your credit scores, you can Pay off your debts on time Avoid applying for numerous credit cards in a short period of time Build a good credit score Avoid relying on just one credit card Review your credit report regularly Check your credit report before applying for loans\nCan I rent out a property on a normal mortgage?\nNo. You must switch to a buy-to-let mortgage with 50% LTV (instead of 80/90%) in order to rent out your home. If you fail to do this, and get caught, you will be in breach of the terms and conditions of your mortgage - which was meant to be used for owner occupation. Then, lenders can recall your mortgage and request you to pay for relevant interest rates and admin fees.\nWhy is building inspection sometimes required for mortgage application?\nThis is to check if there are any structural changes to the property, including illegal structures or subdivided units. If there is, a mortgage application will usually be rejected. Even if it is approved, it will affect the mortgage rates and term.\nWhat are the benefits of joint mortgage applications?\nIt will include two incomes, which makes it easier to pass the stress test. However, both applicants will lose first-time buyer status, making it impossible to apply for a high LTV ratio in the future.\nCompare Mortgage Rates and Cash Rebate now!\nMoneySmart helps you compare numerous mortgage plans in one go. MoneySmart specialists will follow up your mortgage applications directly with your desired bank, which can aggregate your mortgage application.\nStart Comparing!\nImportant Notice\nYour action to give out any personal data in this page will constitute your  consent that MoneySmart HK Limited(MS) will transfer your personal data to One Plus One Property Agency Limited to proceed your loan application. You understand that MS is acting as the referrer only and One Plus One Property Agency Limited will contact you for all further details in relation to your loan application. MS will not be liable for any kind of loss or damage arising from &/or in connection with your deal with One Plus One Property Agency Limited.\nHomeMortgage\nAbout Careers Contact Us\nDisclaimer: At MoneySmart, MoneySmart HK Limited will do a variety of product listing services including but not limited to credit cards, personal loans, home loans and all products from virtual insurance companies.\nFollow us\n© 2009-2024 MoneySmart. All rights reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy.", "content_type": "text", "score": null, "meta": {"url": "https://www.moneysmart.hk/en/mortgage", "content_updated": true}, "id_hash_keys": ["content"], "embedding": null, "id": "cd31b38020afe27c5754245c9ada4e3e"}