{"content": "\n\n\n\n\nAbout Us\nMoneyHero Terms and Conditions\nDate of Last Revision: 11th April 2023\nIn these terms and conditions (as amended from time to time, these “Terms and Conditions”), whenever we use \"MoneyHero\", \"us\", \"we\" and \"our\", it refers to MoneyHero Global Limited (“MHGL”) (registered in Hong Kong under company number 1864714) and/or MoneyHero Insurance Brokers Limited (“MHIBL”) registered in Hong Kong under company number 2196683 and an authorized insurance broker with Insurance Authority License Number FB1740), collectively, and when we use \"you\" and \"your\" it refers to anyone who uses the Services (as described below).\nWe provide our services to you through our website located at www.moneyhero.com.hk (or any subsequent URL which may replace it) (the “Website”) and through our online content, software and services, whether accessed on the Website or through third-party websites, mobile sites and/or applications (collectively, such services, including any new features and applications, and the Website, the “Services”), subject to the following Terms and Conditions\n\nGeneral\nThe access to and use of the Services is subject to the Terms and Conditions and our Privacy Policy and any additional terms applicable to our services that may be posted on or in connection with the Services from time to time, all of which are incorporated by reference herein.  By using the Services, you agree to act according to these Terms and Conditions, our Privacy Policy and any such additional terms.  If you do not agree to comply with these or any future Terms and Conditions or our Privacy Policy, please do not use or access (or continue to use any access) the Services.\nWe work constantly to improve our services and develop new features.  As a result, we reserve the right to make changes to these Terms and Conditions from time to time without prior notice.  You should regularly visit this page to review the current Terms and Conditions so you are aware of any revisions that will apply to you.  If we make any revisions, we will post them on this page and will indicate at the top of this page the date these Terms and Conditions were last revised.  The amended Terms and Conditions will be effective from the date they are posted on the Services.  Your continued use of the Services after any updated Terms and Conditions are in effect will constitute your acceptance of the new Terms and Conditions.\nWe reserve the right to suspend, limit or terminate your use and access of the Services and/or to cancel your account at any time without further notice and for any reason whatsoever.\nThese Terms and Conditions have been prepared in both English and Chinese. In the event of discrepancies between the English and Chinese version, the English version shall apply and prevail.\n\nOur Service\nMHGL offers a free and independent online service that allows you to compare banking and finance products provided by third parties.  The business of MHIBL is to identify insurance products and services provided by third parties that may be of interest to you.  For the avoidance of doubt, other than the provision of marketing services to virtual insurance companies that do not work with insurance intermediaries, MHGL does not carry on an insurance business and all insurance related activities referred to on the Services are carried out solely by MHIBL. \nOur comparison service is free.  We earn money by charging the concerned third-party provider a fee and/or commission for the leads / business generated.\nWe additionally allow you to get assistance and help offline (such as over the telephone) from us for information related to using of the Services and from a third party related to insurance, banking and alternative products or services.  We will not charge you for this service.\nPlease bear in mind that nothing on the Services ought to be thought of, or relied upon, as financial advice or a recommendation or endorsement of any of the specified products or services. All information contained in the Services shall only be used for reference only and you should not treat it as any advice given by us.  Information on the Services may help you choose the product or service that best meets your needs.  However, it is your sole and absolute responsibility to conduct research, to seek independent and professional advice and to ensure the suitability of the product or service that is of interest to you. Ultimately, it is your sole and absolute decision to purchase any product or service, whether it has been featured on our Services or not.\nPlease bear in mind that nothing on the Services is, or shall be deemed to represent, an offer, inducement or proposal by us or any third party to sell to you, any product or service or to enter into any contract with you in respect to any product or service.  By giving us your personal details, you are making a proposal to request for a quote of the relevant product or service from the relevant third party based on its terms and conditions, if any.  The relevant third party reserves the final right to decide whether or not to accept your offer.\nWe aim to give you uninterrupted access to the current Services.  However, we cannot assure you of uninterrupted availability of the Services. We have the absolute right to suspend, limit or terminate your access to the Services at any time.\nWe reserve the right to feature, amend, delete, edit, discontinue or modify the Services and/or any data, content, material or information displayed on the Services at any time without further notice. You agree that we will not be liable to you or to any third party for any modification, suspension or discontinuance of the Services.\n\nRegarding MoneyHero Insurance Brokers Limited\nMHGL and/or its licensors own the Services.  MHGL wholly owns MHIBL, and both are members of the group of companies comprising the Hyphen Group.  MHIBL is an authorized insurance broker and its business is to arrange insurance products and services for its clients.  MHIBL does not represent any particular insurance company in its dealings with clients.  MHIBL is not an insurance company and does not underwrite any insurance risk, nor does it represent any insurance company in its dealings with you.  MHIBL will handle all enquiries relating to contracts of insurance or insurance related matters on the Services.  Other than the provision of marketing services to virtual insurance companies, MHGL does not carry on an insurance business and all insurance related activities on the Services are carried out by MHIBL.  \nFor your information, MHIBL is remunerated for its services by the receipt of commission(s) paid by insurers.  Your agreement to use the Services and to proceed with any insurance transaction through the Services shall constitute your consent to the receipt of commission by MHIBL.\n\nInformation about Insurance Products\nAny contract to obtain an insurance product will be entered into between you and the relevant insurance provider.  All products and services described on the Services or arranged by MHIBL are subject to the terms and conditions of the contract between you and the applicable insurance provider. You are advised to read these terms and conditions carefully and to satisfy yourself that you understand such terms and conditions thoroughly (and in appropriate cases, seek professional advice on the meaning, operation and substantive effect of these terms and conditions) before you enter a contract for such products or services.  If you are in doubt as to your obligations under these Terms and Conditions or if you wish to seek assistance in relation to our services, you are encouraged to contact our customer service department.\nNo insurance coverage shall be construed as bound, in force, applied for or assumed as a result of your submission of data to MHGL and/or MHIBL on the Services or otherwise unless and until notification of coverage has been sent to you by MHGL and/or MHIBL or the relevant insurance company/provider.\nUnless otherwise specified, products and services described in this Website are not available to persons who are outside Hong Kong SAR or to persons who do not possess legal capacity to enter into contracts, such as minors, and accordingly, no contract purported to be entered by these persons will bind MHIBL or MHGL.\nWhere appropriate and with your consent, all documents related to insurance products may be sent to you electronically.  In cases where insurance documents cannot be delivered electronically due to legal constraints, physical forms will be posted to you upon your request.\nInformation on the Services and all materials pertaining to products and services on offer are not representative of, and thus must not be treated as a complete description of the particular and individual terms and conditions of, nor the precise cover provided by the relevant product or service.  It is your sole responsibility to seek independent and professional advice and to ensure all details and information provided to us and displayed on the Services are accurate and reliable.  With respect to any specific product or service, the terms and conditions of the provider of that product or service shall prevail should contradictions arise with the information set out on the Services.\nPrior to any cover being confirmed or provided to you, you should fully and faithfully inform MHIBL of everything you know, or could reasonably be expected to know that could be relevant in the process or the decision to grant you the requested insurance.  You are obliged (i) to disclose every fact which would influence the judgment of a prudent insurer in fixing the premium or determining whether to underwrite the risk; (ii) not to misrepresent material facts and (iii) not to make fraudulent claims.  A fact is material and requires disclosure to the insurer (even if not asked or prompted by the insurer in the proposal form or any other communication between you and the insurer, whether through MHIBL or not) if it is relevant to the nature of the risk sought to be covered.  To do otherwise may result in receiving no benefit from your chosen policy.\nYou agree that submission of your information on our Services shall never in any way be considered as an acceptance of any offer and/or your request to purchase any product or service, and that nothing on the Services shall be treated as an invitation to do any of these actions.  MHIBL's request for a policy shall not be construed as an offer by MHIBL to provide a product to you.\nYou must read and accept all applicable terms, conditions, exclusions, and limitations of any policy before entering any agreement or arrangement with an insurer.\nBy proceeding with the purchase of an insurance product through the Services you authorise MHGL & MHIBL to pass your personal data to Stripe, our third party payment gateway service provider (or any replacement or successor payment gateway provider) to charge your credit card account through Stripe for the amount of the insurance premium.\nWith respect to insurance products, it is your responsibility to read all applicable terms and conditions, including any relating to time periods in which premiums may (or may not) be refunded.  \n\nMobile Services\nThe Services include certain services that may be available through a mobile device, including (i) the ability to submit information to the Services via a mobile device and (ii) the ability to browse the Services and the Website from a mobile device (together, the “Mobile Services”).  To the extent that you access the Services through a mobile device, your wireless service carrier’s standard charges, data rates and other fees may apply.  In addition, using certain Mobile Services may be prohibited or restricted by your carrier, and not all Mobile Services may work with all carriers or devices.  By using the Mobile Services and/or providing your mobile telephone number to us through the Services, you agree that we may communicate with you regarding our products and services and/or our service providers by SMS, MMS, text message or other electronic means to your mobile device and that certain information about your usage of the Mobile Services may be communicated to us.  In the event you change or deactivate your mobile telephone number, you agree to promptly update information that you have submitted to us.\n\nPermitted Use\nYou are solely permitted to access and use the Services for personal or non-commercial functions, which means the Services shall only be accessed and used directly by a private individual or by a legal entity to find a product or service for that individual or entity on their own behalf. Any other kind of access to and use of the Services beyond those are mentioned in this paragraph is strictly prohibited.\nIn order to protect the safety and well-being of others and the integrity and security of our Services, you agree that you cannot use the Services (or facilitate or support others to do so):\nto do or to share anything that breaches these Terms and Conditions or any policies that we publish and which apply to your use of the Services;\nin any unlawful, fraudulent, improper, unauthorized, harassing, discriminatory, libelous, abusive, threatening, harmful, vulgar, obscene or otherwise objectionable manner or in any way that may be harmful or detrimental to our rights (including intellectual property rights) or interests or the rights (including intellectual property rights) or interests of any of our third party providers, or in any manner that could constitute a criminal offence or give rise to civil liability or regulation, in all cases as determined by us;\nin any way that infringes or breaches our rights or someone else’s rights;\nto alter, modify, reverse assemble or reverse engineer any part of the Services;\nin a way that interferes with, disrupts or imposes an unreasonable or disproportionately large burden on our communications and technical systems as determined by us; and/or\nusing any automatic computer code, process, program, robot, net crawler, spider, data processing, trawling or alternative ‘screen scraping’ computer code, process, program or system.\nAnyone using the Services in any of the above ways or engaging in any of the above activities are acting in breach of these Terms and Conditions and should stop using the Services immediately.\nYou acknowledge that we may establish general practices and limits concerning use of the Services. You agree that we have no responsibility or liability for the deletion or failure to store any data or other content maintained by or uploaded to the Services. You further acknowledge that we reserve the right to change these general practices and limits at any time, in our sole discretion, with or without notice.\n\nYour Responsibilities\nYou may complete a registration as a part of your use of the Services.  Your username and password should be kept confidential by you and not be disclosed to or shared with anyone.  If you choose to share these details with anyone, you are absolutely liable for all activities undertaken on the Services using your username and password.\nIf you choose to contact us in connection with the Services, you agree to provide and maintain (as applicable) true, accurate, current and complete information about yourself and/or any other person (such as a family member, associate or beneficiary, if relevant to the product or service) as prompted by one of our tools or forms that appears on our Services.  Any personal data or other information that you submit using our tools or forms during account creation or otherwise (including any information you provide in relation to your family members), and certain other information about you that may be automatically collected when using the Services, is governed by our Privacy Policy.  By providing any information about another person (or persons) such as a family member, associate or beneficiary), you warrant and guarantee that you have the authority to act on such person’s behalf (whether by appointment or by application of law) and that you have obtained any requisite consents to our processing of their personal data as set out in our Privacy Policy.\nYou have to take all necessary precautions to make sure that any data, content, material or information you submit or provide to us via the Services (“User Content”) are free from viruses, spyware, malicious software and anything which can have a contaminating, harmful or damaging impact on any part of this Services, our Content (as described below) or the websites of third parties or any other technology.  \nYou are responsible for your conduct on the Services and for your User Content.  You guarantee that your User Content does not violate any privacy rights, holding rights (such as copyright, information rights and trademarks) or alternative rights of any third party (including any right of confidentiality).  \nFurthermore, your User Content should not violate any law.  User Content should not be harmful, fraudulent, threatening, defamatory, embarrassing, distressing, infringing, abusive, inflammatory, daunting, harassing, libelous, stalking, profane, obscene, indecent, inappropriate, hateful, discriminatory or racially, ethnically, sexually or otherwise objectionable or prohibited by any applicable laws or regulations.  We reserve the right to investigate and take appropriate legal action against anyone who, in our sole discretion, violates this provision, including without limitation, removing the offending content from the Services, restricting such violator’s access to the Services and reporting the violator to the appropriate authorities.\nYou must comply with all applicable laws, statutes and regulations when using our Services.  You agree to be held wholly responsible for any harm, loss, claim, demand, liability or expense (including reasonable legal fees) that we suffer directly or indirectly as a result of your breach of these Terms and Conditions, your breach of contract or warranty, willful act or omission, misrepresentation, negligence in relation to, or in association with, your access and/or use of the Services and/or in relation to your submission and accuracy of your User Content.\nFor the avoidance of doubt, you are responsible for:\n(i) ensuring and confirming, if required, that the credit card (or other payment method) that is being used is yours, or that you have been specifically authorized by the owner of the credit card (or other payment method) to use it;\n(ii) ensuring and confirming (including by the provision of identity or other verification documents) if required, that the phone number (or other receipt method) that is being used to accept funds is yours; and\n(iii) complying with any terms and conditions and charges imposed by third party service providers in connection with payment gateway services they provide to facilitate your online payments.\nYou irrevocably agree to indemnify and hold us harmless for any claims, liabilities, losses, claims, damages and expenses (including reasonable legal fees) arising from or in relation to (i) your use and misuse of our Services (ii) your breach of any of the provisions of these Terms and Conditions; (iii) your infringement of any intellectual property rights or (iv) any third parties claims against us arising from or in relation to the aforementioned events under (i), (ii) or (iii).\n\nIntellectual Property Rights\nYou agree and acknowledge that the Services may contain or display data, content, images, material or information (“Content”) that is protected by copyright, trademark, patent, trade secret or other proprietary rights and laws and is our property and/or the property of our third-party licensors.  You can print, copy, transfer or store extracts of content, material or information displayed on the Services for your own personal use if you abide by the following conditions:\nContent cannot be used for any business or commercial functions without our written permission. Such rights cannot be sold, licensed or transferred to any third party without our express written consent\nYou are not permitted to modify or change any of the Content on the Services.  It shall not be excerpted, reproduced, published, used, reformatted and/or displayed on another website without our written permission;\nthe standing of us and our licensors as authors of such data, content, material or information should be acknowledged at all times;\nImages, logos, trademarks or service marks, displayed on the Services are either our property or the property of our third-party licensors and are protected by the applicable copyright laws, trademark laws, the laws of privacy and publicity and/or other intellectual property law(s).  Any unauthorized use of images, logos, trademarks or service marks, displayed on the Services may violate the applicable laws.\nAll intellectual property rights such as patents, trademarks, logos, net domain names, ethical rights, data, supply codes, software, specifications, know-how, processes and business strategies (in all cases whether or not registered or unregistered and as well as all rights to use for registration) in and about the Services (including data or Content displayed on it) are owned by us and/or our licensors and all such rights are reserved.  Nothing in these Terms and Conditions or our Services grants you, by implication, estoppel, or otherwise, any license or right to use the Content except as expressly stated in these Terms and Conditions.  Except as mentioned elsewhere in these Terms and Conditions, none of the intellectual property rights that belong to us or our licensors in and about the Services (including data or Content displayed on it) can be used, copied, modified, published, transmitted, sold, excerpted, reverse designed, reproduced, reformatted or distributed by you without our express written consent in each instance.\n\nLicense to Use your Submissions\nWe encourage you to tell us how we can improve the Services.  The Services provide you with the opportunity to send us questions, comments, suggestions, ideas, feedback or other information about the Services (“Submissions”) through online forms, email, social media or other channels.  By submitting or otherwise providing your Submissions (including, for these purposes, User Content) to us, you agree and acknowledge that your Submissions are non-confidential and you grant us a non-exclusive unrestricted, perpetual, irrevocable, transferable, sub-licensable, royalty-free license to use your Submissions in any manner and for any purpose, commercial or otherwise, without acknowledgment or compensation to you, other than personal data which will only be used in accordance with our Privacy Policy.  \n\nExclusions of Liability\nWe take all efforts to ensure that the information, material, data and knowledge on the Services, including but not limited to that from a third party, are true, correct and accurate and to rectify any errors or omissions as soon as practicable upon being notified of them.  However, we do not warrant and hereby disclaim any warranty, express or implied, as to the accuracy, correctness, reliability, timeliness or non-infringement of any information, material or knowledge contained on the Services which are provided on an “as is” and “as available” basis.  \nWe aim to give you uninterrupted access to the Services.  However, we do not guarantee or warrant that any Content or functions associated with the Services will be uninterrupted or error free, or that defects will be corrected or that the Services and its server will be free of all viruses and/or other harmful elements.  \nWe are not liable and assume no responsibility for losses or damages of any kind however caused as a result (direct or indirect) of the use or access of, or the inability to use and access the Services, including but not limited to any damage or loss suffered as a result of reliance on the Content, and/or arising out of or in connection with these Terms and Conditions whether in contract, tort or otherwise, even if we have been informed of the possibility of such damage.  Any and all liability for any and all indirect losses or damages suffered or incurred by you or those which were not foreseeable as a result of your access and/or use of the Services is excluded.  \nNotwithstanding the foregoing, nothing in these Terms and Conditions shall limit our liability for personal injury or death, fraud, or for any other liability the exclusion or limitation of which is not permitted by any applicable law or regulation.\nYou will be able to apply for a variety of products and services via this Website. The products and services are provided by third parties. You are solely responsible for your choice of product or service. We are not responsible or liable for (directly or indirectly) for any loss or harm you will suffer or incur as a result of any product or service you received and/or purchased in a result of or on the basis of using the Services or for any acts, omissions, errors or defaults of any third party in reference to that product or service.  Please bear in mind that the data and descriptions of products and services on the Services might not represent the entire descriptions of all the options and terms and conditions of these products and services.  You need to make sure that you carefully look at all the options and the terms and conditions of any product or service before purchasing it.\nWhen you purchase an insurance product on the Services, please ensure that all details are correct; under no circumstances will refunds be provided once the insurance certificate has been issued. Neither MHGL nor MHIBL will have any liability for refunds once the insurance certificate has been issued.\n\nThird Party Liability\nOur Services may provide you with access to third-party websites. The views expressed in third-party websites do not represent our views and we will not be responsible for the accuracy or content of any such views or expressions. Use of the hyperlinks and access to such linked websites are entirely at your own risk.\nYour use of any third-party website is regulated by the terms and conditions and privacy policy of that website. Such terms and conditions and privacy policy may totally differ from these Terms and Conditions and our Privacy Policy.  It is your responsibility to go through the terms and conditions and privacy policy of the relevant third-party websites before using that website.  We are not responsible for any loss you will suffer or incur resulting or arising from the terms and conditions or the privacy policy of any third party website or for any acts, omissions, errors or defaults of any third party as a result of their terms and conditions and/or privacy policy.\nAll hyperlinks to other websites are provided as a matter of convenience to you as a user of the Services.  In no circumstances shall we be considered associated or affiliated in whatever manner with any trade or service marks, logos or insignia that appears on such third-party websites.\nThe Services may provide, or third parties may provide, links or other access to other sites and resources on the Internet. Under no circumstances will we be liable in any way for any content or materials of any third parties (including users) appearing on the Services, including, but not limited to, for any errors or omissions in any content, or for any loss or damage of any kind incurred as a result of the use of any such content.\n\nJurisdiction\nThe Services are controlled and operated in Hong Kong.  These Terms and Conditions, and any non-contractual obligations arising out of or in connection with these Terms and Conditions, will be governed by the laws of Hong Kong and you irrevocably agree to submit to the exclusive jurisdiction of the courts of Hong Kong.\n\nComplaint Procedure\nWe aim to provide all our customers with a high level of service and satisfaction but if you wish to complain about any aspect of our services with you please contact us on 3018 9760 or write to:\n22/F, East Exchange Tower, 38 Leighton Road, Causeway Bay\nFor the purposes of handling complaints, our working hours are from 9 a.m. to 6 p.m. every Monday to Friday, excluding Public Holidays.\nWe cannot answer complaints on behalf of a third-party product or service provider or accept or admit responsibility for any such complaints. We recommend that you visit the website of the product or service provider and follow their complaints procedure if you wish to lodge a complaint with them.\nIf you have any inquiries or complaints in respect of personal data, you may contact the Privacy Commissioner for Personal Data through one of the following channels:\nPrivacy Commissioner for Personal Data\nRoom 1303, 13/F, Sunlight Tower\n248 Queen’s Road East\nWan Chai\nIn the event that further mediation is required in relation to an issue, a notice can be sent to a higher authority regarding the complaint.  A channel of mediation for insurance-related issues (i.e matters involving MoneyHero Insurance Brokers Limited) is:\nInsurance Authority\n19th Floor, 41 Heung Yip Road,\nWong Chuk Hang\n\nMoneyHero Avios Exclusive Reward Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMortgage Referral Reward Program\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nCiti Cash Back Pre-Approved Campaign\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Exclusive Offer - Apple AirPods Pro Campaign\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Exclusive Offer - Citibank FunFlexi: Sogo Coupon Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Exclusive Offer - Home Insurance / Domestic Helper Insurance Upgraded Reward\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Exclusive Offer - Citibank Summer Offer\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Exclusive Limited Time Offer - Hang Seng Bank MPOWER Card\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Exclusive Limited Time Offer - American Express Credit Card\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Exclusive Offer - FWD HomeCare Insurance\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Summer Reward\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Exclusive Limited Time Offer - UA Finance\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Exclusive Limited Time Offer - American Express Credit Card (Oct 2020)\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Exclusive Limited Time Offer - HK$1,300 Apple Store Gift Card \nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero 7th Anniversary Reward - Apple iPhone 12 Pro Max (512GB)\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Apple Store Gift Card/Jabra earbuds Reward Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero – Amex Campaign Jan 2021\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Samsung Galaxy Buds Pro Reward Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Valuable Capital Apple HomePod Mini / Sony Earphone Reward Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero CNCBI Motion Credit Card AirPods Pro Reward Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Samsung Galaxy Buds Pro Apple Gift Card Reward Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Citigold Samsung Galaxy S21 / Apple Gift Card Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Lu HK HomePod Mini Reward Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Valuable Capital HK Samsung Galaxy Buds Live / Apple Gift Card Reward Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Apple Gift Card / Sony WH-1000XM3 / Shangri-La staycation Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero CNCBI Sogo / Donki coupon and up to $4,000 cash rebate Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Fuyuan HomePod Mini Reward Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Apple Gift Card / Marshall Mode II Earphone / DON DON DONKI Coupon\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Citigold Samsung Galaxy S21 / Apple Gift Card Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero UA Finance $2,000 coupon Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Apple Gift Card / Bose QuietComfort 35 / Marco Polo Hongkong Hotel staycation Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Direct Spot Apple Gift Card Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero x EBSHK Direct Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero W Hotel Gift Voucher / Citigold Samsung Galaxy S21 / Apple Gift Card Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero BRUNO Handy Steamer / Apple Gift Card / Don Don Donki Coupon Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero CNCBI HK$350 Apple Gift Card / $1,000 Times Square Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Apple Gift Card / Sony WH-XB900N/ InterContinental Grand Stanford Staycation Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Citigold W Hotel Gift Voucher / Dyson Purifier Hot+Cool™ / Apple Gift Card Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero BRUNO Soymilk & Soup Blender/ Apple Gift Card / Don Don Donki Coupon Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Apple Gift Card / Bang & Olufsen Beoplay E8 / Kowloon Shangri-La Hotel Staycation Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Standard Chartered Apple HomePod Mini / DONDONDONKI $700 Coupon / BRUNO Compact Hotplate Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Citigold Samsung Galaxy Tab / Dyson Purifier Hot+Cool™ / Apple Gift Card Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Standard Chartered Apple Gift Card / Marshall Major IV Bluetooth Headphone / OSIM uCaress S Back Massager Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero BRUNO Soymilk & Soup Blender/ Apple Gift Card / Don Don Donki Coupon Promotion (Aug 2021)\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero CNCBI HK$500 Apple Gift Card / BRUNO Handy Steamer / Monster Persona Headphone Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Saxo Apple MagSafe Battery Pack / Nespresso C30 Essenza Mini Capsule Coffee Machine Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Apple Gift Card / Sennheiser MOMENTUM True Wireless 2 / Water World Ocean Park Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Valuable Capital HK Apple Gift Card / BRUNO Compact Air Fryer Reward Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Citigold Samsung Galaxy Tab / Dyson Purifier Hot+Cool™ / Apple Gift Card Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Sofi HKTVMall / Don Don Donki coupon Reward Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Standard Chartered Apple Gift Card / Philips Instant Heat Dispenser with Filtration / Fitbit Inspire 2 Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Apple Gift Card / Polaryak Spectrum / Maxell Ozoneo Aroma Diffuser MXAP-FA100 Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero x Citibank Apple Gift Card / Marshall Stockwell II / Marshall Minor III / PURE Fitness Power Pack\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero 5 days Cruisecation by Royal Caribbean Cruises / Dyson V12 Detect Slim™️ Fluffy / Apple Gift Card Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Standard Chartered Apple Gift Card / Philips Instant Heat Dispenser with Filtration / Afternoon Tea for two at Lobby Lounge, Kerry Hotel Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Apple Gift Card / Samsung Galaxy Buds Live / Philips Instant Heat Dispenser with Filtration Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Apple Gift Card / Polaryak Spectrum / Maxell Ozoneo Aroma Diffuser MXAP-FA100 Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Valuable Capital Apple Gift Card / SOGO Gift Certificate Reward Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Citigold Samsung Galaxy Tab / Dyson Purifier Hot+Cool™ / Apple Gift Card Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero Standard Chartered Apple Gift Card / Nespresso Essenza Mini / Samsung Galaxy Buds 2 Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero CNCBI HK$500 Apple Gift Card / BRUNO Soymilk & Soup Blender / Sudio Femtio Wireless Speaker Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nMoneyHero x Citibank Apple Gift Card / Marshall Stockwell II / Marshall Minor III / Samsung Galaxy Watch4 Promotion\nPlease click the following link if you wish to know more about the promotion.\nTerms and Conditions\nContact Us\nMon-Fri 9:30am - 6:00pm\nTel: 3018 9760\nIf you'd like to talk to someone right away, simply give us a call - we're here for you!\n22/F, East Exchange Tower, 38 Leighton Road, Causeway Bay\nHong Kong's #1 personal finance comparison site\nMoneyHero is your go-to resource to find the right financial products. Use our powerful product selection tools and comprehensive analyses to make more rewarding choices.\nSecure & Reliable\nImpartial & Independent\nPersonalised\nKEEP IN TOUCH\nFACEBOOK\nYOUTUBE\nINSTAGRAM\nWhy MoneyHero?\nWe analyse, compare, and review 350+ financial products from 60+ financial institutions to help you find the one that best suits your unique needs to save more and earn extra.\nWe adopt robust data security and privacy measures for the thousands of applications made every month.\nOver 2 million Hongkongers visit our site monthly for answers to their financial questions and discover new ways to earn, save, spend, and invest.\nDon't just take our word for it\nMoneyHero is a way of life whenever I make any financial decision. With MoneyHero, I can now make informed decisions from travel insurance to credit cards because MoneyHero does exceptional comparisons and illustrations from a consumer point of view. I now know I will not be shortchanged as long as I check out MoneyHero beforehand.\nHow Our Comparison Platform Works\nWe simplify the task of finding the right financial product. We develop insightful articles to equip you with the knowledge you need to achieve your financial goals. We also ensure your data is safe and secure. Here are a few extra reasons why MoneyHero is your trusted digital personal finance platform.\nWe are a free, impartial platform that reviews and compares financial products from 60+ financial institutions, securing offers not available on other sites.\nYour interest comes first! We make sure the terms and conditions are transparent and easy to understand.\nOur trained support team is a phone call or an email away, ready to provide attentive service.\nAlways More at MoneyHero\n  Don't want to miss our updates?\nSubscribe now and get the latest tips on how to save and spend wisely!\nor\nLike our Facebook page\nCredit Cards\nPersonal Loans\nCar Insurance\nTravel Insurance\nMedical Insurance\nHome Insurance\nDomestic Helper Insurance\nMortgages\nFinancial Tools\nSecurities Accounts\nGuides\nAbout Us\nDisclaimer: MoneyHero makes every effort to keep information on our website accurate and up-to-date. This information may be different from what you see when you visit a financial institution or service provider’s site. APR and monthly payments shown in personal instalment loan comparison pages are estimated based on calculation of information you enter. All financial products and services are presented without warranty. When evaluating offers, please review the financial institution’s Terms and Conditions. If you find discrepancies in information, please contact the financial institution directly.\n  © 2013 - 2024 MoneyHero Global Limited (registered in Hong Kong under company number 1864714) (“MHGL”). All rights reserved. MoneyHero Insurance Brokers Limited (registered in Hong Kong under company number 2196683) (“MHIBL”) is a wholly owned subsidiary of MHGL. MHIBL is an authorized insurance broker with Insurance Authority License Number FB1740 whose business it is to arrange insurance products and services for its clients. MHGL is not an insurance company, agent or broker. Other than the provision of marketing services to virtual insurance companies that do not work with insurance intermediaries, MHGL does not carry on an insurance business and all insurance-related activities displayed, offered or referred to on this site are carried out solely by MHIBL in its capacity as an insurance broker. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy. \n ", "content_type": "text", "score": null, "meta": {"url": "https://www.moneyhero.com.hk/en/page/moneyhero-terms", "content_updated": true}, "id_hash_keys": ["content"], "embedding": null, "id": "73068cfb5ef029ce759336870b4d1ba5"}