{"content": "The information is not and should not be construed as an offer to buy or sell any investment products, and should not be considered as investment advice. You should carefully consider whether any investment products are appropriate in view of your investment experience, objectives, financial resources and relevant circumstances.\nInvestment involves risk. Investors should not only base on this material alone to make investment decisions. Please refer to the offering documents of the respective funds for details, including product features, fees and charges, and risk factors. The price of units or shares and the income from them may go down as well as up and any past performance figures shown are not indicative of future performance. The information contained on this website is intended for Hong Kong residents only and should not be construed as a distribution, an offer to sell, or a solicitation to buy any securities in any jurisdiction where such activities would be unlawful under the laws of such jurisdiction, in particular the United States of America. Please refer to the unit trust disclaimer for further important details.\nThe Securities and Futures Commission (the 'SFC') has authorised the Equity Linked Investments and offering documents of Equity Linked Investments. The SFC's authorisation does not imply official recommendation or endorsement of equity-linked investments, nor does it guarantee the commercial merits of equity-linked investments or its performance.\nThe contents of this page have not been reviewed by the Securities and Futures Commission.\nIssued by the Hongkong and Shanghai Banking Corporation Limited\n  ESG and sustainable investing risk disclosure \nIn broad terms “ESG and sustainable investing” products include investment approaches or instruments which consider environmental, social, governance and/or other sustainability factors to varying degrees. Certain instruments HSBC (“we”) classify as sustainable may be in the process of changing to deliver sustainability outcomes. There is no guarantee that ESG and Sustainable investing products will produce returns similar to those which don’t consider these factors. ESG and Sustainable investing products may diverge from traditional market benchmarks. In addition, there is no standard definition of, or measurement criteria for, ESG and Sustainable investing or the impact of ESG and Sustainable investing products. ESG and Sustainable investing and related impact measurement criteria are (a) highly subjective and (b) may vary significantly across and within sectors.\nHSBC may rely on measurement criteria devised and reported by third party providers or issuers. HSBC does not always conduct its own specific due diligence in relation to measurement criteria. There is no guarantee: (a) that the nature of the ESG / sustainability impact or measurement criteria of an investment will be aligned with any particular investor’s sustainability goals; or (b) that the stated level or target level of ESG / sustainability impact will be achieved. ESG and Sustainable investing is an evolving area and new regulations are being developed which will affect how investments can be categorised or labelled. An investment which is considered to fulfil sustainable criteria today may not meet those criteria at some point in the future.\nWhen we classify an investment product or service against our ESG and Sustainable Investing (SI) categories described in this document: ESG Enhanced, Thematic or Impact, this does not mean that all individual underlying holdings in the investment product or portfolio will meet the relevant SI criteria. As such, an SI classification does not mean that all underlying holdings in a fund or discretionary portfolio meet the relevant sustainable investment criteria. Similarly, where an equity or fixed income investment is classified under an ESG Enhanced, Thematic or Impact category this does not mean that the underlying issuer’s activities are fully sustainable. Not all investments, portfolios or services are classifiable under our SI categories. This may be because there is insufficient information available or because a particular investment product does not meet HSBC’s SI classifications criteria.\nGreen, Social and Sustainability Bonds risk disclosure\nGreen, Social and Sustainability (GSS) Bond labelling is a voluntary and recommended process and framework established by ICMA, the International Capital Markets Association. It aims to promote the integrity of the green, social and sustainability bond market. The intention is to encourage transparency and disclose on the specific use of proceeds to show investors the environmental and/or social projects financed by the financial instrument. The ICMA framework recommends a specific approved list of use of proceeds, a process for project evaluation and selection, management of proceeds and annual reporting on use of proceeds.\nAlthough the use of proceeds for a GSS bond can be verified by a second party opinion, third party verification or other equivalent process, the Bank cannot guarantee the issuer will indeed manage the use of proceeds to fund green or social projects throughout the life of the outstanding bond as there is no legal way to enforce the declared use of proceeds.\n  Sustainability-linked bonds:\nSustainability-linked bonds are any type of bond instrument for which the financial and/or structural characteristics can vary depending on whether the issue achieves predefined sustainability/ESG objectives. sustainability-linked bonds (SLBs) labelling is a voluntary and recommended process and framework established by ICMA, the International Capital Markets Association. The objectives are (i) measured through predefined key performance indicators (KPIs) and (ii) assessed against predefined sustainability performance targets (SPTs). There is no guarantee SLBs will deliver on their sustainability performance targets and the proceeds of the instrument are not tied to specific environmental and/or social projects.\nAlthough the progress made against the KPIs and SPTs can be verified by a second party opinion, third party verification or other equivalent process, the Bank cannot guarantee the issuer of the financial instrument is making progress against those sustainability/ESG objectives.\n  Risk disclosure – Bonds and certificates of deposit (\"CDs\")\nThere are risks involved in buying bonds / CDs. Before applying for any of bonds / CDs, you should consider whether bonds / CDs is suitable for you in light of your own financial circumstances and objectives. If you are in any doubt, get independent professional advice.\nBonds / CDs are mainly medium to long term fixed income products, not for short term speculation. You should be prepared to hold your funds in bonds / CDs for the full tenor; you could lose part or all of your principal if you choose to sell your bonds / CDs prior to maturity.\nIt is the issuer to pay interest and repay principal of bonds / CDs. If the issuer defaults, the holder of bonds / CDs may not be able to receive back the interest and principal. The holder of bonds / CDs bears the credit risk of the issuer and has no recourse to HSBC unless HSBC is the issuer itself.\nIndicative price of bonds / CDs are available and the bonds / CDs' prices do fluctuate when market changes. Factors affecting market price of bonds / CDs include, and are not limited to, fluctuations in interest rates, credit spreads, and liquidity premiums. The fluctuation in yield generally has a greater effect on prices of longer tenor bonds / CDs. There is an inherent risk that losses may be incurred rather than profit made as a result of buying and selling bonds / CDs.\nIf you wish to sell bonds / CDs, HSBC may repurchase them based on the prevailing market price under normal market circumstances, but the selling price may differ from the original buying price due to changes in market conditions.\nThere may be exchange rate risks if you choose to convert payments made on the bond/CDs to your home currency.\nThe secondary market for bonds / CDs may not provide significant liquidity or may trade at prices based on the prevailing market conditions and may not be in line with the expectations of bonds / CDs' holders.\nIf bonds / CDs are early redeemed, you may not be able to enjoy the same rates of return when you use the funds to purchase other products.\nDo not purchase the bonds / CDs unless you fully understand and are willing to assume the risks associated with it.\n  High yield bonds risk disclosure\nHigh yield bonds are typically rated below investment grade by a credit rating agency, or unrated. Whilst high yield bonds bear a higher yield opportunity than investment grade bonds, they present greater risks of issuer default, liquidity, volatility and non-payment of principal and interest.\nThe risk of default on principal and / or interest, is greater for high yield bonds due to higher credit risk of the issuer and lower priority of claim by the bond holders in case of issuer default.\nHigh yield bonds can sometimes be less liquid than investment-grade bonds, depending on the issuer and the market conditions at any given time. Investors may be difficult to sell the high yield bond before maturity or at prices in line with their expectation compare to listed bond.\nHigh yield bonds tend to be more vulnerable to economic cycles and changes in the issuer's financial conditions or business developments. In particular, during economic downturn, such bonds typically fall more in value than investment-grade bonds as the issuer default risk rises and investors become more risk adverse.\nPlease be aware the concentration risk of investing in bonds issued by the same issuer or companies by the same group. A degrading of any of the group company's credit rating may expose the whole group to contagion risk. Please be also aware the risk of over concentrating investment in the high risk investment products.\n  Risk disclosure – structured products\n\nEquity-linked investments (\"ELIs\") risk dislosure\nThe following risks should be read together with the other risks contained in the \"Risk Warnings\" section in the relevant offering documents of the ELIs.\nYou should note that the information contained in this material does NOT form part of the offering documents of our ELIs. You should read all the offering documents of our ELIs (including the programme memorandum, the financial disclosure document, the relevant product booklet and the indicative term sheet and any addendum to any of such documents) before deciding whether to invest in our ELIs. If you have doubts on the content of this material, you should seek independent professional advice.\nThis is a structured and complex product involving derivatives.\nNot a time deposit – ELI is NOT equivalent to, nor should it be treated as a substitute for, time deposit. It is NOT a protected deposit and is NOT protected by the Deposit Protection Scheme in Hong Kong.\nNot principal-protected – ELIs are not principal-protected: you could lose all of your investment.\nLimited potential gain – you may not receive any potential cash dividend amount. The maximum potential gain under this product is capped at an amount equal to the sum of the difference between the issue price and the nominal amount of the ELIs (if any) (less any cash settlement expenses) and the maximum periodic potential cash dividend amount(s) payable during the scheduled tenor (ie the period from (and including) the issue date to (and including) the settlement date) of the ELIs. It is possible that you may not receive any potential cash dividend amount for the entire scheduled tenor of the ELIs.\nRe-investment risk – If our ELIs are terminated early, we will pay you the nominal amount of the ELIs (less any cash settlement expenses) and any accrued potential cash dividend amount calculated up to (and including) that call date. No further potential cash dividend amount will be payable following such early termination. Market conditions may have changed and you may not be able to enjoy the same rate of return if you re-invest these proceeds in other investments with similar risk parameters.\nNo collateral – ELIs are not secured on any of our assets or any collateral.\nLimited market making arrangements are available and you may suffer a loss if you sell your ELIs before expiry – Our ELIs are designed to be held to their settlement date. Limited market making arrangements are available on a bi-weekly basis for all our ELIs. If you try to sell your ELIs before expiry, the amount you receive for each ELI may be substantially less than the issue price you paid for each ELI.\nNot the same as investing in the reference asset – Investing in our ELIs is not the same as investing in the reference asset. Changes in the market price of the reference asset may not lead to a corresponding change in the market value of, or your potential payout under, the ELIs.\nNot covered by Investor Compensation Fund – Our ELIs are not listed on any stock exchange and are not covered by the Investor Compensation Fund. There may not be any active or liquid secondary market.\nMaximum loss upon HSBC's default or insolvency – Our ELIs constitute general, unsecured and unsubordinated contractual obligations of HSBC as issuer and of no other person (including the ultimate holding company of our group, HSBC Holdings plc). When you buy our ELIs, you will be relying on HSBC's creditworthiness. If HSBC becomes insolvent or defaults on its obligations under the ELIs, in the worst case scenario, you could lose all of your investment.\nRisks relating to RMB – You should note that the value of RMB against other foreign currencies fluctuates and will be affected by, amongst other things, the PRC government's control (for example, the PRC government regulates conversion between RMB and foreign currencies), which may adversely affect your return under this product when you convert RMB into your home currency. The value of your RMB-denominated ELIs will be subject to the risk of exchange rate fluctuation. If you choose to convert your RMB deposit to other currencies at an exchange rate that is less favourable than that in which you made your original conversion to RMB, you may suffer loss in principal. This product (if denominated in RMB) will be denominated and settled in RMB deliverable in Hong Kong, which is different from that of RMB deliverable in mainland China.\nYou may, at settlement, receive physical delivery of reference asset(s).\nOur ELIs may be terminated early by us according to the terms as set out in offering documents of our ELIs.\nOur ELIs are structured investment products which are embedded with derivatives.\nInvestment returns (if any) not denominated in home currency are exposed to exchange rate fluctuations. Rates of exchange may cause the value of investments to go up or down.\nThe Hongkong and Shanghai Banking Corporation Limited is the issuer and product arranger of our ELIs.\n  Renminbi ('RMB') related products risk disclosure\nThere may be exchange rate risks if you choose to convert RMB payments made on the bonds / CDs to your home currency.\nRMB debt instruments are subject to interest rate fluctuations, which may adversely affect the return and performance of the RMB products.\nRMB products may suffer significant losses in liquidating the underlying investments if such investments do not have an active secondary market and their prices have large bid/ offer spreads.\nYou could lose part or all of your principal if you choose to sell your RMB bonds / CDs prior to maturity.\n  Private placement notes (PPNs) risk disclosure\nThe following risks should be read together with the other risks contained in the \"Risk Factors\" section in the relevant offering documents of the PPNs.\nYou should note that the information contained in this website does NOT form part of the offering documents of our PPNs. You should read all the offering documents of our PPNs (including the offering memorandum, and the indicative term sheet) before deciding whether to invest in our PPNs. If you have doubt on the content of this website, you should seek independent professional advice.\nNot a time deposit – PPNs are NOT equivalent to, nor should it be treated as a substitute for, time deposits. It is NOT a protected deposit and is NOT protected by the Deposit Protection Scheme in Hong Kong.\nNot principal-protected – some PPNs are not principal-protected: you could lose all of your investment.\nInvestment return risk – It is possible that you may not receive any potential cash dividend amount for the entire scheduled tenor of the PPNs.\nRe-investment risk – If our PPNs are early terminated, we will pay you the nominal amount of the PPNs (less any cash settlement expenses) and any accrued potential cash dividend amount calculated up to (and including) that call date. No further potential cash dividend amount will be payable following such early termination. Market conditions may have changed and you may not be able to enjoy the same rate of return if you re-invest these proceeds in other investments with similar risk parameters.\nNo collateral – PPNs are not secured on any of our assets or any collateral.\nLimited market making arrangements are available and you may suffer a loss if you sell your PPNs before expiry. Our PPNs are designed to be held to their settlement date. Limited market making arrangements are available on a bi-weekly basis for all our PPNs. If you try to sell your PPNs before expiry, the amount you receive for each PPN may be substantially less than the issue price you paid for each PPN.\nNot the same as investing in the reference asset – Investing in our PPNs is not the same as investing in the reference asset. Changes in the market price of the reference asset may not lead to a corresponding change in the market value of, or your potential payout under, the PPNs.\nNot covered by Investor Compensation Fund – Our PPNs are not listed on any stock exchange and are not covered by the Investor Compensation Fund. There may not be any active or liquid secondary market.\nMaximum loss upon HSBC's default or insolvency – Our PPNs constitute general, unsecured and unsubordinated contractual obligations of HSBC as issuer and of no other person (including the ultimate holding company of our group, HSBC Holdings plc). When you buy our PPNs, you will be relying on HSBC's creditworthiness. If HSBC becomes insolvent or defaults on its obligations under the PPNs, in the worst case scenario, you could lose all of your investment.\nRisks relating to RMB – You should note that the value of RMB against other foreign currencies fluctuates and will be affected by, amongst other things, the PRC government's control (for example, the PRC government regulates conversion between RMB and foreign currencies), which may adversely affect your return under this product when you convert RMB into your home currency. The value of your RMB-denominated PPNs will be subject to the risk of exchange rate fluctuation. If you choose to convert your RMB deposit to other currencies at an exchange rate that is less favourable than that in which you made your original conversion to RMB, you may suffer loss in principal. This product (if denominated in RMB) will be denominated and settled in RMB deliverable in Hong Kong, which is different from that of RMB deliverable in mainland China.\nYou may, at settlement, receive physical delivery of reference asset(s).\nOur PPNs may be terminated early by us according to the terms as set out in offering documents of our PPNs.\nOur PPNs are structured investment products which are embedded with derivatives.\nInvestment returns (if any) not denominated in home currency are exposed to exchange rate fluctuations. Rates of exchange may cause the value of investments to go up or down.\n  The Hongkong and Shanghai Banking Corporation Limited is the issuer and product arranger of our ELIs.\nHSBC Bank plc is the issuer and product arranger of our PPNs.\nThe information contained in this material and the content have not been reviewed by the Securities and Futures Commission of Hong Kong or any regulatory authority in Hong Kong.\nInvestment involves risk. The price of products may move up or down. Losses may be incurred as well as profits made as a result of buying and selling products.\nYou should carefully consider whether any investment products or services mentioned herein are appropriate for you in view of your investment experience, objectives, financial resources and circumstances.\nMaking available to you any advertisements, marketing or promotional materials, market information or other information relating to a product or service shall not, by itself, constitute solicitation of the sale or recommendation of any product or service. If you wish to receive solicitation or recommendation from us, please contact us and, where relevant, go through our suitability assessment before transacting. The remuneration for sales staff is determined based on the staff's overall performance with reference to a wide range of factors, and is subject to review from time to time, for the purpose of encouraging the building of deep, long-lasting and mutually valuable relationships with customers. It is not determined solely on financial performance.\nThe information in this material does not constitute a solicitation or recommendation for making any deposit or an offer for the purchase or sale or investment in any products.\nIssued by The Hongkong and Shanghai Banking Corporation Limited", "content_type": "text", "score": null, "meta": {"url": "https://www.hsbc.com.hk/investments/esg/", "content_updated": true}, "id_hash_keys": ["content"], "embedding": null, "id": "5fb5bbd34a46ecd61de0a94b60d23568"}