{"content": "\n\n\n\n\n文章\n人生保障\n保險分析\n【 自願醫保計劃懶人包】VHIS保障、保費、特點全分析\nMONEYHERO保險專家\n最後更新於 25 九月, 2020\n自願醫保計劃（Voluntary Health Insurance Scheme，簡稱 VHIS ）2019年4月正式推出，大家對此計劃仍有林林總總的疑問。你是否還不太了解自願性醫保跟一般醫保及危疾保險有甚麼分別？又或在猶豫自己適不適合投保？ MoneyHero 特別整合了以下懶人包，讓有興趣的市民深入了解自願醫保產品。\n一. 計劃簡介\n二. 產品類別\n三. 甚麼人適合參加醫保？\n  一. 計劃簡介\n甚麼是自願醫療保障計劃？\n醫保計劃由食物及衛生局推出，目的主要有兩個：一是規範香港市面上的個人住院保險，提高醫保對投保人的保障；二是鼓勵更多香港市民購買醫保，使用私營醫療服務，從而減輕公營醫療系統的壓力。\n參與此計劃的保險公司將會推出經當局認可的醫保產品，相比起市面上的醫療保險，這些受認可的產品需達到一定要求，務求為消費者帶來較全面的醫療保障。雖然此計劃是由政府推出，但保險公司和市民的參與均屬自願性質，據知目前已有至少7間保險公司宣佈參加此計劃。\n醫保有甚麼好處？\n1. 可續保至100歲\n現時市面上很多保險公司只接受65歲以下人士購買醫療保險，只有兩成醫保計劃接受80歲或以上長者續保。就算長者成功投保，不保事項會較多，保障範圍較遜色。而自願性醫保保單可供年齡介乎15天至80歲人士投保，並保證續保到100歲。\n2. 保障範圍更廣\n自願性醫保產品比現時大部分住院保險的承保範圍更廣，新增的保障範圍包括：\n未知的已有疾病 — 未知的投保前已有病症也將受保，但設三年過渡期：保單生效後第一年不獲賠償，第二年可獲 25%償款，第三年可獲 50%償款，第四年起可獲100%償款\n先天性疾病 — 投保人於年屆8歲後出現或確診的先天性疾病的檢測及治療\n日間手術 — 非住院情況下進行的外科手術（包括內窺鏡）\n精神科治療 — 本地醫院的精神科病房中留醫的相關費用\n    3. 保費支出可扣稅\n政府為鼓勵巿民購買自願性醫保，將會修訂稅務條例，就市民的保費支出提供稅務扣減。詳情可查看 【自願醫保扣稅教學】買醫保可慳幾多稅？一人幫全家投保最著數\n4. 設21日冷靜期\n投保人享21日冷靜期，期間可取消保單並全數取回已付保費。\n5. 保費透明\n保險公司必須公佈其醫保認可產品的保費表，以增加市場透明度及促進價格競爭。\n延伸閱讀：住院保險邊間好？比較保費及與醫療保險分別\n      二. 產品類別\n標準計劃及靈活計劃\n醫保計劃提供兩類認可產品，分別是提供基本醫療保障的「標準計劃」及提供更多保障的「靈活計劃」。兩種計劃的主要區別如下：\n標準計劃 — 按醫保最低要求提供的標準化保障。換言之，所有保險公司提供的標準計劃之保障範圍及保障額均是相同。\n靈活計劃 — 較標準計劃提供額外保障（例如更高的保障額，或更大的保障範圍）以切合不同人士的需要。各保險公司可自行設計不同的靈活計劃供消費者選購，但條款及細則亦須經食衛局批准。\n食衛局建議可以附加的額外保障，包括意外緊急門診、家居看護、善終療養、門診洗腎、康復治療和牙科護理等，但條款及細則亦須經食衛局批准，消費者應參閱保險公司公佈之最終產品細節。\n標準計劃保障表\n下表為醫保標準計劃認可產品的統一保障項目及限額，同時亦是「靈活計劃」的最低保障要求。想知更多保單詳情，可查閱官方公佈的認可產品保單範本。\n保險項目 保險限額\n病房及膳食 每日HK$750 每個保單年度最多180日\n雜項費用 每個保單年度HK$14,000\n主診醫生巡房費 每日HK$750\n每個保單年度最多180日\n專科醫生費 每個保單年度HK$4,300\n深切治療 每日HK$3,500 每個保單年度最多25日\n外科醫生費 (住院及日間手術服務) 每宗手術最多HK$50,000\n複雜：HK$50,000\n大型：HK$25,000\n中型：HK$12,000\n小型：HK$5,000\n麻醉科醫生費 外科醫生費的35%\n手術室費用 外科醫生費的35%\n先進診斷成像檢測\n包括：電腦斷層掃描 (CT)、磁力共振掃描 (MRI)、正電子放射斷層掃描 (PET)、PET–CT 組合 、PET–MRI 組合\n每保單年度 HK$20,000 設 30% 共同保險\n非手術癌症治療\n包括：放射性治療、化療、標靶治療、免疫治療及荷爾蒙治療\n每個保單年度HK$80,000\n入院前或出院後 / 日間手術前後的門診護理 每次HK$580，每保單年度HK$3,000 • 住院 / 日間手術前最多1次門診或急症診症\n• 出院 / 日間手術後90日內最多3次跟進門診\n精神科治療 每個保單年度HK$30,000\n每年保障限額 HK$420,000\n終身保障限額 無\n  自願性醫保的保費是多少？\n根據自願醫保網頁的資料顯示，市面上各間保險公司的標準計劃，以一名非吸煙的女性，各年齡層的保費大概如下：\n投保人年齡 保費\n約20歲 HK$1,320-HK$4,104\n約40歲 HK$2,544-HK$5,994\n約60歲 約HK$5,112-HK$15,063\n  無論是標準計劃還是靈活計劃，醫保產品的保費都會由各保險公司自行制定，但公司必須公佈保費表，以增加價格透明度。按食衛局規定，保費可因應年齡增長及性別有所不同，但不會因受保人的健康狀況有變而增加保費率。另外，整體保費水平可每年根據醫療通脹情況及保障額修訂等因素而調整，而根據過往數據顯示，香港按年醫療通脹約為5%。\n三. 甚麼人適合參加自願性醫保？\n香港公立醫院資源緊絀，部分專科門診及手術輪候時間長達數個月至數年。對於有一定財政負擔能力的市民而言，一份醫保可以幫自己或家人省卻公院輪候時間，又可獲得質素更高的私院醫療服務。再加上醫保比市面醫保更具保障，保費公開透明，保證續保至百歲，保障未知已有疾病等優惠，都令消費者更為放心。\n儘管如此，在決定參加醫保前，建議大家先考慮以下幾點：\n1. 醫保的保額是否足夠？\n根據官方公佈的自願性醫保保障表，標準計劃的承保項目之保障額只屬「基本盤」，保額有機會不足以支付全部費用。以白內障手術為例，此手術屬於「中型手術」，一般私院或私家診所收費介乎HK$20,000至HK$40,000，但標準計劃下的保單賠償限額只有HK$12,000，餘下款項需要由自己支付。\n若認為標準計劃的保額不足，市民應考慮「靈活計劃」下的醫保產品，但當然保費亦會比標準計劃高，投保前建議大家「貨比三家」，再決定哪一份保單最適合自己。\n2. 你是否已經持有一份醫療保險？\n如果你已經供有一份個人醫保，並且在過往受保期間曾確診新症（尤其是長期病患），在轉用新保單時就要留意是否需要「核保」— 即申報已有病歷。因為市場上大多數的醫療保險產品都不承保投保前已有的病症，相反，若在受保期間確診，同一份保單則會繼續承保該症。在這種情況下，受保人重新「核保」可能會得不償失。\n不過，並非轉新保單就一定要核保。醫保計劃列明，市民在登記參與自願性醫保後，保險公司須提供一次機會讓現有投保人選擇將現有保單轉移至認可產品。換言之，若投保人將現有保單轉移至同一公司的醫保產品，則有可能不需要重新核保。\n3. 為什麼對初生嬰兒及長者較為吸引？\n80歲前可投保，並保證續保到100歲\n不設終身賠償限額\n保障範圍涵蓋至「未知的」已有疾病及8歲後出現或確診的先天性疾病（但於首三個保單年度，只會獲部分賠償）\n初生嬰兒：出生15天已可投保\n對很多父母來說，初生嬰兒的住院、疾病醫療保障是至關重要，初生嬰兒出生15天，已經可以購買醫療保險，而醫保更保障「未知的」已有疾病以及先天性疾病。就算將來小朋友突然確診一些天生罕見病，雖然於頭3年的等候期內未能獲得全數保障，畢竟已為小朋友及父母織了第一層安全網。如果嬰兒不幸地天生體弱，或者較大機會患上長期病患而承擔長期醫療費用，選擇自願性醫保則更為合適。\n長者：80歲前可投保 續保到100歲\n自願性醫保照顧了長者一族，令原本難以投保的長者亦可獲得保障。而且保費透明度高，保險公司可以根據標準保費表，每年按受保人年齡而收取保費；但在每個保單年度內，或者受保人續保時，保險公司不可以因為受保人的健康狀況變化，而增加附加保費率或者增加個別不保事項。所以對於身體狀況可能隨時出問題的長者，自願性醫保的保障相對之下穩定得多。\n加上市面上的普通醫療保險，可能設有終身索償上限，一旦超出上限，投保人未必能續保並要選擇其他計劃。但自願性醫保不設「終身可獲保障總額上限」，以「標準計劃」而言，每年保障額高達42萬，加上續保至100歲的條件，可分擔一家人面對的長遠醫療費用壓力。\n資料來源︰政府自願醫保計劃網頁及富衛香港\n上述產品資料及文章內容只供參考，應以政府不時公佈之資料為準。不同保險公司的自願性醫保產品可能存在差異，投保前須了解清楚、分析和比較從而找出合適的保險產品。\n保險好難明？為自己及家人著想，即睇：保險攻略大全\n相關文章：【保險陷阱】「全保」唔係最著數 醫病要買危疾定醫療保險？\n相關文章：【醫療保險比較 】善用公司團體醫保 教你揀最全面的醫保保障\n相關文章：【信用卡交保費攻略】4種方法交保費賺信用卡積分、現金回贈、里數！\n想了解及比較更多醫療保險、旅遊保險及其他金融產品？請即瀏覽MoneyHero比較平台！\n  想知道最新嘅理財貼士，就要留意 MoneyHero Blog，同埋緊貼我哋嘅 Facebook Page！\n  Tags\n保費 醫療保險 自願醫保 自願醫保計劃\nMONEYHERO保險專家\n回到文章\nRelated Articles\n保險分析\n交通意外賠償｜撞車處理程序、索償期限、交通意外和解書範本\n十月 7, 2022\n保險分析\nAIG美亞旅遊保險好唔好︱新冠肺炎醫療／隔離保障＋手機電腦賠償比較\n十月 5, 2022\n保險分析\n火險比較 | 火險邊間好？教你用按揭/投保額計算火險保費\n十月 3, 2022\n金融產品、理財熱話、投資知識\n立即訂閱MoneyHero電子通訊，最新理財資訊、獨家優惠搶先睇\n信用卡比較\n私人貸款比較\n旅遊保險比較\n汽車保險比較\n年金資訊\n醫療保險比較\n家居保險比較\n家傭保險比較\n按揭比較\n理財戶口\n證券戶口\n信貸評分\n理財管理指南\n關於我們\n聲明﹕MoneyHero致力確保網站提供的資訊是最新及最準確。網站所顯示的資訊或與金融機構或服務供應商之網站有所出入。MoneyHero網站顯示的金融產品及服務資訊僅供參考，並非提供建議。貸款產品比較頁面顯示的實際年利率及每月還款額是根據閣下所輸入的資料而作出之估算。考慮申請產品前，我們建議你查閱產品之官方條款及細則。如發現資訊有出入，請直接聯絡相關金融機構。\n© 2013 - 2024 MoneyHero Global Limited（於香港註冊，公司編號為 1864714）(“MHGL”)。版權所有。MoneyHero Insurance Brokers Limited（於香港註冊，公司編號為2196683）(”MHIBL”) 為MHGL全資擁有的子公司。 MHIBL於香港註冊，公司編號為2196683，亦為一間許可編號為FB1740的授權保險經紀，其業務是為客戶安排保險產品及服務。 MHGL不是保險公司，代理人或經紀。除了向虛擬保險公司提供營銷服務外，MHGL不會從事保險業務。本網站所顯示，提供或提及的所有與保險有關的活動均由MHIBL以經紀人身分提供。閣下使用我們的網站表明接受 我們的 使用條款 和 私隱政策。 \n ", "content_type": "text", "score": null, "meta": {"url": "https://www.moneyhero.com.hk/en/vhis", "content_updated": true}, "id_hash_keys": ["content"], "embedding": null, "id": "babb8666ce41324b333e17078f53a525"}